pawelr89/fw-custom-mega-stm32f407vet6/generated/controllers/generated/rusefi_generated_mega-stm32f407vet6.h
//
// was generated automatically by rusEFI tool config_definition-all.jar based on gen_config.sh integration/rusefi_config.txt
//

#define adc_channel_e_auto_enum 0="EFI_ADC_NONE",1="EFI_ADC_0",2="EFI_ADC_1",11="EFI_ADC_10",12="EFI_ADC_11",13="EFI_ADC_12",14="EFI_ADC_13",15="EFI_ADC_14",16="EFI_ADC_15",17="EFI_ADC_16",18="EFI_ADC_17",19="EFI_ADC_18",20="EFI_ADC_19",3="EFI_ADC_2",21="EFI_ADC_20",22="EFI_ADC_21",23="EFI_ADC_22",24="EFI_ADC_23",25="EFI_ADC_24",26="EFI_ADC_25",27="EFI_ADC_26",28="EFI_ADC_27",29="EFI_ADC_28",30="EFI_ADC_29",4="EFI_ADC_3",31="EFI_ADC_30",32="EFI_ADC_31",33="EFI_ADC_32",34="EFI_ADC_33",35="EFI_ADC_34",36="EFI_ADC_35",37="EFI_ADC_36",38="EFI_ADC_37",39="EFI_ADC_38",40="EFI_ADC_39",5="EFI_ADC_4",41="EFI_ADC_40",42="EFI_ADC_41",43="EFI_ADC_42",44="EFI_ADC_43",45="EFI_ADC_44",46="EFI_ADC_45",47="EFI_ADC_46",48="EFI_ADC_47",6="EFI_ADC_5",7="EFI_ADC_6",8="EFI_ADC_7",9="EFI_ADC_8",10="EFI_ADC_9",50="EFI_ADC_ERROR",49="EFI_ADC_TOTAL_CHANNELS"
#define adc_channel_e_EFI_ADC_0 1
#define adc_channel_e_EFI_ADC_1 2
#define adc_channel_e_EFI_ADC_10 11
#define adc_channel_e_EFI_ADC_11 12
#define adc_channel_e_EFI_ADC_12 13
#define adc_channel_e_EFI_ADC_13 14
#define adc_channel_e_EFI_ADC_14 15
#define adc_channel_e_EFI_ADC_15 16
#define adc_channel_e_EFI_ADC_16 17
#define adc_channel_e_EFI_ADC_17 18
#define adc_channel_e_EFI_ADC_18 19
#define adc_channel_e_EFI_ADC_19 20
#define adc_channel_e_EFI_ADC_2 3
#define adc_channel_e_EFI_ADC_20 21
#define adc_channel_e_EFI_ADC_21 22
#define adc_channel_e_EFI_ADC_22 23
#define adc_channel_e_EFI_ADC_23 24
#define adc_channel_e_EFI_ADC_24 25
#define adc_channel_e_EFI_ADC_25 26
#define adc_channel_e_EFI_ADC_26 27
#define adc_channel_e_EFI_ADC_27 28
#define adc_channel_e_EFI_ADC_28 29
#define adc_channel_e_EFI_ADC_29 30
#define adc_channel_e_EFI_ADC_3 4
#define adc_channel_e_EFI_ADC_30 31
#define adc_channel_e_EFI_ADC_31 32
#define adc_channel_e_EFI_ADC_32 33
#define adc_channel_e_EFI_ADC_33 34
#define adc_channel_e_EFI_ADC_34 35
#define adc_channel_e_EFI_ADC_35 36
#define adc_channel_e_EFI_ADC_36 37
#define adc_channel_e_EFI_ADC_37 38
#define adc_channel_e_EFI_ADC_38 39
#define adc_channel_e_EFI_ADC_39 40
#define adc_channel_e_EFI_ADC_4 5
#define adc_channel_e_EFI_ADC_40 41
#define adc_channel_e_EFI_ADC_41 42
#define adc_channel_e_EFI_ADC_42 43
#define adc_channel_e_EFI_ADC_43 44
#define adc_channel_e_EFI_ADC_44 45
#define adc_channel_e_EFI_ADC_45 46
#define adc_channel_e_EFI_ADC_46 47
#define adc_channel_e_EFI_ADC_47 48
#define adc_channel_e_EFI_ADC_5 6
#define adc_channel_e_EFI_ADC_6 7
#define adc_channel_e_EFI_ADC_7 8
#define adc_channel_e_EFI_ADC_8 9
#define adc_channel_e_EFI_ADC_9 10
#define adc_channel_e_EFI_ADC_ERROR 50
#define adc_channel_e_EFI_ADC_NONE 0
#define adc_channel_e_EFI_ADC_TOTAL_CHANNELS 49
#define adc_channel_e_enum "Disabled", "PA0", "PA1", "PA2", "PA3", "PA4", "PA5", "PA6", "PA7", "PB0", "PB1", "PC0", "PC1", "PC2", "PC3", "PC4", "PC5"
#define adc_channel_e_fullenum "Disabled", "PA0", "PA1", "PA2", "PA3", "PA4", "PA5", "PA6", "PA7", "PB0", "PB1", "PC0", "PC1", "PC2", "PC3", "PC4", "PC5"
#define ADC_CHANNEL_NONE 0
#define afr_sensor_s_size 20
#define air_pressure_sensor_config_s_size 12
#define air_pressure_sensor_type_e_auto_enum 0="MT_CUSTOM",10="MT_BOSCH_2_5",1="MT_DENSO183",4="MT_DODGE_NEON_2003",13="MT_GM_1_BAR",12="MT_GM_2_BAR",6="MT_GM_3_BAR",3="MT_HONDA3BAR",11="MT_MAZDA_1_BAR",7="MT_MPX4100",2="MT_MPX4250",9="MT_MPX4250A",15="MT_MPXH6300",14="MT_MPXH6400",5="MT_SUBY_DENSO",8="MT_TOYOTA_89420_02010"
#define air_pressure_sensor_type_e_MT_BOSCH_2_5 10
#define air_pressure_sensor_type_e_MT_CUSTOM 0
#define air_pressure_sensor_type_e_MT_DENSO183 1
#define air_pressure_sensor_type_e_MT_DODGE_NEON_2003 4
#define air_pressure_sensor_type_e_MT_GM_1_BAR 13
#define air_pressure_sensor_type_e_MT_GM_2_BAR 12
#define air_pressure_sensor_type_e_MT_GM_3_BAR 6
#define air_pressure_sensor_type_e_MT_HONDA3BAR 3
#define air_pressure_sensor_type_e_MT_MAZDA_1_BAR 11
#define air_pressure_sensor_type_e_MT_MPX4100 7
#define air_pressure_sensor_type_e_MT_MPX4250 2
#define air_pressure_sensor_type_e_MT_MPX4250A 9
#define air_pressure_sensor_type_e_MT_MPXH6300 15
#define air_pressure_sensor_type_e_MT_MPXH6400 14
#define air_pressure_sensor_type_e_MT_SUBY_DENSO 5
#define air_pressure_sensor_type_e_MT_TOYOTA_89420_02010 8
#define ALTERNATOR_VOLTAGE_TARGET_SIZE 4
#define antiLagActivationMode_e_ALWAYS_ON_ANTILAG 1
#define antiLagActivationMode_e_auto_enum 0="SWITCH_INPUT_ANTILAG",1="ALWAYS_ON_ANTILAG"
#define antiLagActivationMode_e_enum "Switch Input", "Always Active"
#define antiLagActivationMode_e_SWITCH_INPUT_ANTILAG 0
#define AUX_DIGITAL_VALVE_COUNT 2
#define AUX_SPEED_SENSOR_COUNT 2
#define BANKS_COUNT 2
#define BARO_CORR_SIZE 4
#define BENCH_AC_RELAY_DURATION 800
#define BENCH_FAN_DURATION 2000
#define BENCH_FUEL_PUMP_DURATION 3000
#define BENCH_MAIN_RELAY_DURATION 1000
#define bench_mode_e_BENCH_AC_COMPRESSOR_RELAY 6
#define bench_mode_e_BENCH_AUXOUT0 20
#define bench_mode_e_BENCH_AUXOUT1 21
#define bench_mode_e_BENCH_AUXOUT2 22
#define bench_mode_e_BENCH_AUXOUT3 23
#define bench_mode_e_BENCH_AUXOUT4 24
#define bench_mode_e_BENCH_AUXOUT5 25
#define bench_mode_e_BENCH_AUXOUT6 26
#define bench_mode_e_BENCH_AUXOUT7 27
#define bench_mode_e_BENCH_CANCEL 15
#define bench_mode_e_BENCH_CHECK_ENGINE_LIGHT 7
#define bench_mode_e_BENCH_FAN_RELAY 4
#define bench_mode_e_BENCH_FAN_RELAY_2 5
#define bench_mode_e_BENCH_FUEL_PUMP 1
#define bench_mode_e_BENCH_GPPWM1_VALVE 10
#define bench_mode_e_BENCH_GPPWM2_VALVE 11
#define bench_mode_e_BENCH_GPPWM3_VALVE 12
#define bench_mode_e_BENCH_GPPWM4_VALVE 13
#define bench_mode_e_BENCH_HPFP_VALVE 9
#define bench_mode_e_BENCH_IDLE_VALVE 8
#define bench_mode_e_BENCH_MAIN_RELAY 0
#define bench_mode_e_BENCH_SECOND_IDLE_VALVE 14
#define bench_mode_e_BENCH_STARTER_DISABLE_RELAY 3
#define bench_mode_e_BENCH_STARTER_ENABLE_RELAY 2
#define bench_mode_e_BENCH_VVT0_VALVE 16
#define bench_mode_e_BENCH_VVT1_VALVE 17
#define bench_mode_e_BENCH_VVT2_VALVE 18
#define bench_mode_e_BENCH_VVT3_VALVE 19
#define bench_mode_e_HD_ACR 28
#define bench_mode_e_HD_ACR2 29
#define BENCH_STARTER_DURATION 4000
#define BENCH_VVT_DURATION 300
#define blend_table_s_size 188
#define BLOCKING_FACTOR 750
#define BOARD_CONSTANTS_EXTENSIONS_FROM_FILE 
#define BOARD_CURVES_FROM_FILE 
#define BOARD_DIAG_PANEL1_FROM_FILE 
#define BOARD_DIAG_PANEL2_FROM_FILE 
#define BOARD_ENGINE_CONFIGURATION_FROM_FILE 
#define BOARD_GAUGES_FROM_FILE 
#define BOARD_MENU_FROM_FILE 
#define BOARD_OPTIONS_FROM_FILE 
#define BOARD_PANELS_FROM_FILE 
#define BOARD_PC_VARIABLES_FROM_FILE 
#define BOARD_TABLES_FROM_FILE 
#define BOARD_VE_MENU_FROM_FILE 
#define BOOST_BLEND_COUNT 2
#define BOOST_CURVE_SIZE 5
#define BOOST_LOAD_COUNT 8
#define BOOST_RPM_COUNT 8
#define boostType_e_auto_enum 0="OPEN_LOOP",1="CLOSED_LOOP"
#define boostType_e_CLOSED_LOOP 1
#define boostType_e_OPEN_LOOP 0
#define brain_input_pin_e_enum "NONE", "INVALID", "PA0", "PA1", "PA2", "PA3", "PA4", "PA5", "PA6", "PA7", "PA8", "PA9", "PA10", "PA11", "PA12", "PA13", "PA14", "PA15", "PB0", "PB1", "PB2", "PB3", "PB4", "PB5", "PB6", "PB7", "PB8", "PB9", "PB10", "PB11", "PB12", "PB13", "PB14", "PB15", "PC0", "PC1", "PC2", "PC3", "PC4", "PC5", "PC6", "PC7", "PC8", "PC9", "PC10", "PC11", "PC12", "PC13", "PC14", "PC15", "PD0", "PD1", "PD2", "PD3", "PD4", "PD5", "PD6", "PD7", "PD8", "PD9", "PD10", "PD11", "PD12", "PD13", "PD14", "PD15", "PE0", "PE1", "PE2", "PE3", "PE4", "PE5", "PE6", "PE7", "PE8", "PE9", "PE10", "PE11", "PE12", "PE13", "PE14", "PE15", "PF0", "PF1", "PF2", "PF3", "PF4", "PF5", "PF6", "PF7", "PF8", "PF9", "PF10", "PF11", "PF12", "PF13", "PF14", "PF15", "PG0", "PG1", "PG2", "PG3", "PG4", "PG5", "PG6", "PG7", "PG8", "PG9", "PG10", "PG11", "PG12", "PG13", "PG14", "PG15", "PH0", "PH1", "PH2", "PH3", "PH4", "PH5", "PH6", "PH7", "PH8", "PH9", "PH10", "PH11", "PH12", "PH13", "PH14", "PH15", "PI0", "PI1", "PI2", "PI3", "PI4", "PI5", "PI6", "PI7", "PI8", "PI9", "PI10", "PI11", "PI12", "PI13", "PI14", "PI15"
#define brain_input_pin_e_fullenum "NONE", "INVALID", "PA0", "PA1", "PA2", "PA3", "PA4", "PA5", "PA6", "PA7", "PA8", "PA9", "PA10", "PA11", "PA12", "PA13", "PA14", "PA15", "PB0", "PB1", "PB2", "PB3", "PB4", "PB5", "PB6", "PB7", "PB8", "PB9", "PB10", "PB11", "PB12", "PB13", "PB14", "PB15", "PC0", "PC1", "PC2", "PC3", "PC4", "PC5", "PC6", "PC7", "PC8", "PC9", "PC10", "PC11", "PC12", "PC13", "PC14", "PC15", "PD0", "PD1", "PD2", "PD3", "PD4", "PD5", "PD6", "PD7", "PD8", "PD9", "PD10", "PD11", "PD12", "PD13", "PD14", "PD15", "PE0", "PE1", "PE2", "PE3", "PE4", "PE5", "PE6", "PE7", "PE8", "PE9", "PE10", "PE11", "PE12", "PE13", "PE14", "PE15", "PF0", "PF1", "PF2", "PF3", "PF4", "PF5", "PF6", "PF7", "PF8", "PF9", "PF10", "PF11", "PF12", "PF13", "PF14", "PF15", "PG0", "PG1", "PG2", "PG3", "PG4", "PG5", "PG6", "PG7", "PG8", "PG9", "PG10", "PG11", "PG12", "PG13", "PG14", "PG15", "PH0", "PH1", "PH2", "PH3", "PH4", "PH5", "PH6", "PH7", "PH8", "PH9", "PH10", "PH11", "PH12", "PH13", "PH14", "PH15", "PI0", "PI1", "PI2", "PI3", "PI4", "PI5", "PI6", "PI7", "PI8", "PI9", "PI10", "PI11", "PI12", "PI13", "PI14", "PI15"
#define brain_pin_diag_e_PIN_DRIVER_OFF 0x20
#define brain_pin_diag_e_PIN_DRIVER_OVERTEMP 0x10
#define brain_pin_diag_e_PIN_OK 0
#define brain_pin_diag_e_PIN_OPEN 0x01
#define brain_pin_diag_e_PIN_OVERLOAD 0x08
#define brain_pin_diag_e_PIN_SHORT_TO_BAT 0x04
#define brain_pin_diag_e_PIN_SHORT_TO_GND 0x02
#define brain_pin_diag_e_PIN_UNKNOWN 0x80
#define C_MC33810_COUNT 1
#define CAM_1_MODE_NAME "Cam mode (intake)"
#define CAM_2_MODE_NAME "Cam mode (exhaust)"
#define CAM_INPUTS_COUNT 4
#define CAMS_PER_BANK 2
#define can_baudrate_e_auto_enum 0="B50KBPS",2="B100KBPS",3="B125KBPS",6="B1MBPS",4="B250KBPS",5="B500KBPS",1="B83KBPS"
#define can_baudrate_e_B100KBPS 2
#define can_baudrate_e_B125KBPS 3
#define can_baudrate_e_B1MBPS 6
#define can_baudrate_e_B250KBPS 4
#define can_baudrate_e_B500KBPS 5
#define can_baudrate_e_B50KBPS 0
#define can_baudrate_e_B83KBPS 1
#define can_baudrate_e_enum "50kbps", "83.33kbps", "100kbps", "125kbps", "250kbps", "500kbps", "1Mbps"
#define CAN_BENCH_HEADER2 0x66
#define CAN_DEFAULT_BASE 0x200
#define CAN_ECU_SERIAL_RX_ID 0x710
#define CAN_ECU_SERIAL_TX_ID 0x720
#define can_nbc_e_auto_enum 0="CAN_BUS_NBC_NONE",12="CAN_AIM_DASH",4="CAN_BUS_BMW_E46",6="CAN_BUS_BMW_E90",10="CAN_BUS_GENESIS_COUPE",11="CAN_BUS_HONDA_K",7="CAN_BUS_Haltech",3="CAN_BUS_MAZDA_RX8",8="CAN_BUS_MQB",13="CAN_BUS_MS_SIMPLE_BROADCAST",1="CAN_BUS_NBC_FIAT",2="CAN_BUS_NBC_VAG",9="CAN_BUS_NISSAN_VQ",5="CAN_BUS_W202_C180"
#define can_nbc_e_CAN_AIM_DASH 12
#define can_nbc_e_CAN_BUS_BMW_E46 4
#define can_nbc_e_CAN_BUS_BMW_E90 6
#define can_nbc_e_CAN_BUS_GENESIS_COUPE 10
#define can_nbc_e_CAN_BUS_Haltech 7
#define can_nbc_e_CAN_BUS_HONDA_K 11
#define can_nbc_e_CAN_BUS_MAZDA_RX8 3
#define can_nbc_e_CAN_BUS_MQB 8
#define can_nbc_e_CAN_BUS_MS_SIMPLE_BROADCAST 13
#define can_nbc_e_CAN_BUS_NBC_FIAT 1
#define can_nbc_e_CAN_BUS_NBC_NONE 0
#define can_nbc_e_CAN_BUS_NBC_VAG 2
#define can_nbc_e_CAN_BUS_NISSAN_VQ 9
#define can_nbc_e_CAN_BUS_W202_C180 5
#define CAN_RX_PREFIX "CAN_rx"
#define can_vss_nbc_e_auto_enum 0="BMW_e46",2="BMW_e90",5="HONDA_CIVIC9",4="HYUNDAI_PB",3="NISSAN_350",1="W202"
#define can_vss_nbc_e_BMW_e46 0
#define can_vss_nbc_e_BMW_e90 2
#define can_vss_nbc_e_HONDA_CIVIC9 5
#define can_vss_nbc_e_HYUNDAI_PB 4
#define can_vss_nbc_e_NISSAN_350 3
#define can_vss_nbc_e_W202 1
#define CanGpioType_auto_enum 0="NONE",1="DRT",2="MS"
#define CanGpioType_DRT 1
#define CanGpioType_enum "None", "DRT protocol", "MS protocol"
#define CanGpioType_MS 2
#define CanGpioType_NONE 0
#define CLT_CRANKING_CURVE_SIZE 8
#define CLT_CURVE_SIZE 16
#define CLT_LIMITER_CURVE_SIZE 4
#define CLT_TIMING_CURVE_SIZE 8
#define CLT_UPPER_LIMIT 250
#define CMD_AC_RELAY_BENCH "acrelaybench"
#define CMD_ALTERNATOR_PIN "set_alternator_pin"
#define CMD_BOOST_PIN "set_boost_pin"
#define CMD_BURNCONFIG "burnconfig"
#define CMD_DATE "date"
#define CMD_DISABLE "disable"
#define CMD_ECU_UNLOCK "unlock"
#define CMD_ENABLE "enable"
#define CMD_ENGINE_TYPE "engine_type"
#define CMD_ENGINESNIFFERRPMTHRESHOLD "engineSnifferRpmThreshold"
#define CMD_ETB_DUTY "set_etb_duty"
#define CMD_EXTERNAL_STIMULATION "ext_stimulation"
#define CMD_FAN2_BENCH "fan2bench"
#define CMD_FAN_BENCH "fanbench"
#define CMD_FUEL_BENCH "fuelbench"
#define CMD_FUEL_PUMP_BENCH "fuelpumpbench"
#define CMD_FUNCTIONAL_TEST_MODE "test_mode"
#define CMD_GET "get"
#define CMD_HPFP_BENCH "hpfpbench"
#define CMD_IDLE_BENCH "idlebench"
#define CMD_IDLE_PIN "set_idle_pin"
#define CMD_IGNITION "ignition"
#define CMD_IGNITION_PIN "set_ignition_pin"
#define CMD_INDIVIDUAL_INJECTION "set_individual_coils_ignition"
#define CMD_INJECTION "injection"
#define CMD_INJECTION_PIN "set_injection_pin"
#define CMD_LOGIC_PIN "set_logic_input_pin"
#define CMD_MIL_BENCH "milbench"
#define CMD_PINS "pins"
#define CMD_PWM "pwm"
#define CMD_REBOOT "reboot"
#define CMD_REBOOT_DFU "reboot_dfu"
#define CMD_REBOOT_OPENBLT "reboot_openblt"
#define CMD_RESET_ENGINE_SNIFFER "reset_engine_chart"
#define CMD_RESET_SENSOR_MOCKS "reset_sensor_mocks"
#define CMD_RESET_SIMULATOR "reset_simulator"
#define CMD_RPM "rpm"
#define CMD_SELF_STIMULATION "self_stimulation"
#define CMD_SET "set"
#define CMD_SET_SENSOR_MOCK "set_sensor_mock"
#define CMD_SPARK_BENCH "sparkbench"
#define CMD_STARTER_BENCH "starterbench"
#define CMD_TRIGGER_HW_INPUT "trigger_hw_input"
#define CMD_TRIGGER_PIN "set_trigger_input_pin"
#define CMD_TRIGGER_SIMULATOR_PIN "set_trigger_simulator_pin"
#define CMD_TRIGGERINFO "triggerinfo"
#define CMD_VSS_PIN "vss_pin"
#define CMD_WRITECONFIG "writeconfig"
#define COIL_1_NAME "Spark #1"
#define COIL_2_NAME "Spark #2"
#define COMPOSITE_PACKET_SIZE 5
#define CONSOLE_DATA_PROTOCOL_TAG " @"
#define CRANKING_ADVANCE_CURVE_SIZE 4
#define CRANKING_CLT_IDLE_CURVE_SIZE 8
#define CRANKING_CURVE_SIZE 8
#define CRANKING_CYCLE_CLT_SIZE 4
#define CRANKING_ENRICH_COUNT 6
#define cranking_parameters_s_size 8
#define CRITICAL_BUFFER_SIZE 120
#define CRITICAL_PREFIX "CRITICAL"
#define CYLINDER_BORE_MULTIPLIER 1
#define CYLINDER_BORE_TOOLTIP "Cylinder diameter in mm"
#define CYLINDER_BORE_UNITS "mm"
#define DAC_OUTPUT_COUNT 2
#define dc_function_e_auto_enum 0="DC_None",3="DC_IdleValve",1="DC_Throttle1",2="DC_Throttle2",4="DC_Wastegate"
#define dc_function_e_DC_IdleValve 3
#define dc_function_e_DC_None 0
#define dc_function_e_DC_Throttle1 1
#define dc_function_e_DC_Throttle2 2
#define dc_function_e_DC_Wastegate 4
#define dc_io_size 8
#define DC_PER_STEPPER 2
#define debug_mode_e_auto_enum 0="DBG_0",1="DBG_1",10="DBG_10",11="DBG_11",12="DBG_12",13="DBG_13",16="DBG_16",19="DBG_19",2="DBG_2",20="DBG_20",21="DBG_21",22="DBG_22",24="DBG_24",25="DBG_25",26="DBG_26",27="DBG_27",29="DBG_29",32="DBG_32",34="DBG_34",35="DBG_35",36="DBG_36",37="DBG_37",38="DBG_38",43="DBG_43",46="DBG_46",5="DBG_5",6="DBG_6",7="DBG_7",8="DBG_8",9="DBG_9",40="DBG_COMPOSITE_LOG",33="DBG_DWELL_METRIC",44="DBG_DYNO_VIEW",17="DBG_ELECTRONIC_THROTTLE_PID",4="DBG_EL_ACCEL",39="DBG_ETB_AUTOTUNE",18="DBG_EXECUTOR",30="DBG_ION",15="DBG_KNOCK",45="DBG_LOGIC_ANALYZER",48="DBG_LUA",28="DBG_METRICS",14="DBG_SR5_PROTOCOL",3="DBG_STEPPER_IDLE_CONTROL",47="DBG_TCU",31="DBG_TLE8888",41="DBG_UNUSED41",42="DBG_UNUSED_42",23="UNUSED23"
#define debug_mode_e_DBG_0 0
#define debug_mode_e_DBG_1 1
#define debug_mode_e_DBG_10 10
#define debug_mode_e_DBG_11 11
#define debug_mode_e_DBG_12 12
#define debug_mode_e_DBG_13 13
#define debug_mode_e_DBG_16 16
#define debug_mode_e_DBG_19 19
#define debug_mode_e_DBG_2 2
#define debug_mode_e_DBG_20 20
#define debug_mode_e_DBG_21 21
#define debug_mode_e_DBG_22 22
#define debug_mode_e_DBG_24 24
#define debug_mode_e_DBG_25 25
#define debug_mode_e_DBG_26 26
#define debug_mode_e_DBG_27 27
#define debug_mode_e_DBG_29 29
#define debug_mode_e_DBG_32 32
#define debug_mode_e_DBG_34 34
#define debug_mode_e_DBG_35 35
#define debug_mode_e_DBG_36 36
#define debug_mode_e_DBG_37 37
#define debug_mode_e_DBG_38 38
#define debug_mode_e_DBG_43 43
#define debug_mode_e_DBG_46 46
#define debug_mode_e_DBG_5 5
#define debug_mode_e_DBG_6 6
#define debug_mode_e_DBG_7 7
#define debug_mode_e_DBG_8 8
#define debug_mode_e_DBG_9 9
#define debug_mode_e_DBG_COMPOSITE_LOG 40
#define debug_mode_e_DBG_DWELL_METRIC 33
#define debug_mode_e_DBG_DYNO_VIEW 44
#define debug_mode_e_DBG_EL_ACCEL 4
#define debug_mode_e_DBG_ELECTRONIC_THROTTLE_PID 17
#define debug_mode_e_DBG_ETB_AUTOTUNE 39
#define debug_mode_e_DBG_EXECUTOR 18
#define debug_mode_e_DBG_ION 30
#define debug_mode_e_DBG_KNOCK 15
#define debug_mode_e_DBG_LOGIC_ANALYZER 45
#define debug_mode_e_DBG_LUA 48
#define debug_mode_e_DBG_METRICS 28
#define debug_mode_e_DBG_SR5_PROTOCOL 14
#define debug_mode_e_DBG_STEPPER_IDLE_CONTROL 3
#define debug_mode_e_DBG_TCU 47
#define debug_mode_e_DBG_TLE8888 31
#define debug_mode_e_DBG_UNUSED41 41
#define debug_mode_e_DBG_UNUSED_42 42
#define debug_mode_e_enum "INVALID", "TPS acceleration enrichment", "INVALID", "Stepper Idle Control", "Engine Load accl enrich", "Trigger Counters", "Soft Spark Cut", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "SD card", "sr5", "Knock", "INVALID", "Electronic Throttle", "Executor", "Bench Test / TS commands", "INVALID", "Analog inputs #1", "INSTANT_RPM", "INVALID", "Status", "INVALID", "INVALID", "MAP", "Metrics", "INVALID", "Ion Sense", "TLE8888", "Analog inputs #2", "Dwell Metric", "INVALID", "INVALID", "Boost Control", "INVALID", "INVALID", "ETB Autotune", "Composite Log", "INVALID", "INVALID", "INVALID", "Dyno_View", "Logic_Analyzer", "INVALID", "TCU", "Lua"
#define debug_mode_e_UNUSED23 23
#define DEFAULT_RPM_AXIS_HIGH_VALUE 7000
#define DEFAULT_SELT_STIM_RPM 1200
#define DEFAULT_SELT_STIM_VVT0 23
#define DEFAULT_SOLENOID_FREQUENCY 300
#define DIGIPOT_COUNT 4
#define display_mode_e_DM_HD44780 1
#define display_mode_e_DM_HD44780_OVER_PCF8574 2
#define display_mode_e_DM_NONE 0
#define DWELL_CURVE_SIZE 8
#define ego_sensor_e_auto_enum 0="ES_BPSX_D1",2="ES_14Point7_Free",6="ES_AEM",5="ES_Custom",1="ES_Innovate_MTX_L",4="ES_PLX"
#define ego_sensor_e_enum "BPSX", "Innovate", "14Point7", "INVALID", "PLX", "Custom", "AEM"
#define ego_sensor_e_ES_14Point7_Free 2
#define ego_sensor_e_ES_AEM 6
#define ego_sensor_e_ES_BPSX_D1 0
#define ego_sensor_e_ES_Custom 5
#define ego_sensor_e_ES_Innovate_MTX_L 1
#define ego_sensor_e_ES_PLX 4
#define EGT_CHANNEL_COUNT 8
#define END_OF_CALIBRATION_PADDING 128
#define engine_configuration_s_size 4024
#define engine_load_mode_e_auto_enum 0="LM_SPEED_DENSITY",2="LM_ALPHA_N",3="LM_LUA",100="LM_MOCK",1="LM_REAL_MAF"
#define engine_load_mode_e_enum "Speed Density", "MAF Air Charge", "Alpha-N", "Lua"
#define engine_load_mode_e_LM_ALPHA_N 2
#define engine_load_mode_e_LM_LUA 3
#define engine_load_mode_e_LM_MOCK 100
#define engine_load_mode_e_LM_REAL_MAF 1
#define engine_load_mode_e_LM_SPEED_DENSITY 0
#define ENGINE_MAKE_BMW "BMW"
#define ENGINE_MAKE_GM "GM"
#define ENGINE_MAKE_HONDA "Honda"
#define ENGINE_MAKE_Hyundai "Hyundai"
#define ENGINE_MAKE_LADA "Lada"
#define ENGINE_MAKE_MAZDA "Mazda"
#define ENGINE_MAKE_MERCEDES "Mercedes"
#define ENGINE_MAKE_NISSAN "Nissan"
#define ENGINE_MAKE_SUBARU "Subaru"
#define ENGINE_MAKE_TOYOTA "Toyota"
#define ENGINE_MAKE_VAG "VAG"
#define ENGINE_NOISE_CURVE_SIZE 16
#define ENGINE_SNIFFER_UNIT_US 10
#define engine_type_e_auto_enum 0="DEFAULT_FRANKENSO",22="BMW_M52",50="BMW_M73_MRE",51="BMW_M73_MRE_SLAVE",38="DISCOVERY_PDM",2="DODGE_NEON_1995",46="DODGE_NEON_2003_CRANK",64="DODGE_RAM",61="EEPROM_BENCH_ENGINE",58="ETB_BENCH_ENGINE",21="ET_BOSCH_QUICK_START",24="ET_TEST_WITH_BOSCH_QUICK_START",55="ET_UNUSED_55",56="ET_UNUSED_56",105="FERRARI_F136",3="FORD_ASPIRE_1996",11="FORD_COYOTE",14="FORD_ESCORT_GT",7="FORD_INLINE_6_1995",40="FRANKENSO_BMW_M73_F",41="FRANKENSO_MIATA_NA6_MAP",59="FRANKENSO_TEST_33810",15="FUEL_BENCH",98="GM_SBC",8="GY6_139QMB",6="HARLEY",84="HELLEN_121_NISSAN_4_CYL",72="HELLEN_121_NISSAN_6_CYL",85="HELLEN_121_NISSAN_8_CYL",87="HELLEN_121_NISSAN_ALMERA_N16",71="HELLEN_121_VAG_4_CYL",77="HELLEN_121_VAG_5_CYL",81="HELLEN_121_VAG_8_CYL",78="HELLEN_121_VAG_V6_CYL",79="HELLEN_121_VAG_VR6_CYL",36="HELLEN_128_MERCEDES_4_CYL",88="HELLEN_128_MERCEDES_6_CYL",89="HELLEN_128_MERCEDES_8_CYL",82="HELLEN_154_HYUNDAI_COUPE_BK1",95="HELLEN_154_HYUNDAI_COUPE_BK2",76="HELLEN_154_VAG",75="HELLEN_2CHAN_STIM_QC",74="HELLEN_4CHAN_STIM_QC",57="HELLEN_HONDA_BCM",43="HONDA_600",90="HONDA_K",66="HONDA_OBD1",91="HONDA_OBD2A",104="HYUNDAI_PB",60="L9779_BENCH_ENGINE",54="MAVERICK_X3",34="MAZDA_MIATA_NA6",80="MAZDA_MIATA_NA94",10="MAZDA_MIATA_NA96",83="MAZDA_MIATA_NB1",69="MAZDA_MIATA_NB2",86="MAZDA_MIATA_NB2_36",20="MAZDA_MIATA_NC",33="ME17_9_MISC",68="MERCEDES_M111",1="MIATA_PROTEUS_TCU",99="MINIMAL_PINS",12="MITSUBISHI_3A92",16="MITSUBISHI_4G93",31="MRE_BOARD_NEW_TEST",23="MRE_BODY_CONTROL",4="MRE_SECONDARY_CAN",37="MRE_SUBARU_EJ18",62="MRE_VW_B6",5="NISSAN_PRIMERA",35="POLARIS",9="POLARIS_RZR",30="PROTEUS_ANALOG_PWM_TEST",63="PROTEUS_BMW_M73",27="PROTEUS_GM_LS_4",25="PROTEUS_LUA_DEMO",103="PROTEUS_NISSAN_VQ35",42="PROTEUS_QC_TEST_BOARD",73="PROTEUS_STIM_QC",39="PROTEUS_VW_B6",29="SACHS",92="SIMULATOR_CONFIG",70="SUBARU_EG33",17="TCU_4R70W",100="TEST_100",101="TEST_101",18="TEST_33816",28="TEST_CRANK_ENGINE",48="TEST_DC_WASTEGATE_DISCOVERY",26="TEST_ENGINE",45="TEST_ENGINE_VVT",52="TEST_ISSUE_366_BOTH",53="TEST_ISSUE_366_RISE",93="TEST_ISSUE_6451",19="TEST_ROTARY",13="TOYOTA_1NZ_FE",44="TOYOTA_2JZ_GTE_VVTi",102="UNUSED102",47="UNUSED47",49="UNUSED49",67="UNUSED67",94="UNUSED94",65="UNUSED_65",97="UNUSED_97",32="VW_ABA",96="WASTEGATE_PROTEUS_TEST"
#define engine_type_e_BMW_M52 22
#define engine_type_e_BMW_M73_MRE 50
#define engine_type_e_BMW_M73_MRE_SLAVE 51
#define engine_type_e_DEFAULT_FRANKENSO 0
#define engine_type_e_DISCOVERY_PDM 38
#define engine_type_e_DODGE_NEON_1995 2
#define engine_type_e_DODGE_NEON_2003_CRANK 46
#define engine_type_e_DODGE_RAM 64
#define engine_type_e_EEPROM_BENCH_ENGINE 61
#define engine_type_e_ET_BOSCH_QUICK_START 21
#define engine_type_e_ET_TEST_WITH_BOSCH_QUICK_START 24
#define engine_type_e_ET_UNUSED_55 55
#define engine_type_e_ET_UNUSED_56 56
#define engine_type_e_ETB_BENCH_ENGINE 58
#define engine_type_e_FERRARI_F136 105
#define engine_type_e_FORD_ASPIRE_1996 3
#define engine_type_e_FORD_COYOTE 11
#define engine_type_e_FORD_ESCORT_GT 14
#define engine_type_e_FORD_INLINE_6_1995 7
#define engine_type_e_FRANKENSO_BMW_M73_F 40
#define engine_type_e_FRANKENSO_MIATA_NA6_MAP 41
#define engine_type_e_FRANKENSO_TEST_33810 59
#define engine_type_e_FUEL_BENCH 15
#define engine_type_e_GM_SBC 98
#define engine_type_e_GY6_139QMB 8
#define engine_type_e_HARLEY 6
#define engine_type_e_HELLEN_121_NISSAN_4_CYL 84
#define engine_type_e_HELLEN_121_NISSAN_6_CYL 72
#define engine_type_e_HELLEN_121_NISSAN_8_CYL 85
#define engine_type_e_HELLEN_121_NISSAN_ALMERA_N16 87
#define engine_type_e_HELLEN_121_VAG_4_CYL 71
#define engine_type_e_HELLEN_121_VAG_5_CYL 77
#define engine_type_e_HELLEN_121_VAG_8_CYL 81
#define engine_type_e_HELLEN_121_VAG_V6_CYL 78
#define engine_type_e_HELLEN_121_VAG_VR6_CYL 79
#define engine_type_e_HELLEN_128_MERCEDES_4_CYL 36
#define engine_type_e_HELLEN_128_MERCEDES_6_CYL 88
#define engine_type_e_HELLEN_128_MERCEDES_8_CYL 89
#define engine_type_e_HELLEN_154_HYUNDAI_COUPE_BK1 82
#define engine_type_e_HELLEN_154_HYUNDAI_COUPE_BK2 95
#define engine_type_e_HELLEN_154_VAG 76
#define engine_type_e_HELLEN_2CHAN_STIM_QC 75
#define engine_type_e_HELLEN_4CHAN_STIM_QC 74
#define engine_type_e_HELLEN_HONDA_BCM 57
#define engine_type_e_HONDA_600 43
#define engine_type_e_HONDA_K 90
#define engine_type_e_HONDA_OBD1 66
#define engine_type_e_HONDA_OBD2A 91
#define engine_type_e_HYUNDAI_PB 104
#define engine_type_e_L9779_BENCH_ENGINE 60
#define engine_type_e_MAVERICK_X3 54
#define engine_type_e_MAZDA_MIATA_NA6 34
#define engine_type_e_MAZDA_MIATA_NA94 80
#define engine_type_e_MAZDA_MIATA_NA96 10
#define engine_type_e_MAZDA_MIATA_NB1 83
