pawelr89/fw-custom-mega-stm32f407vet6/generated/controllers/generated/rusefi_generated_mega-stm32f407vet6.h
#define engine_type_e_MAZDA_MIATA_NB2 69
#define engine_type_e_MAZDA_MIATA_NB2_36 86
#define engine_type_e_MAZDA_MIATA_NC 20
#define engine_type_e_ME17_9_MISC 33
#define engine_type_e_MERCEDES_M111 68
#define engine_type_e_MIATA_PROTEUS_TCU 1
#define engine_type_e_MINIMAL_PINS 99
#define engine_type_e_MITSUBISHI_3A92 12
#define engine_type_e_MITSUBISHI_4G93 16
#define engine_type_e_MRE_BOARD_NEW_TEST 31
#define engine_type_e_MRE_BODY_CONTROL 23
#define engine_type_e_MRE_SECONDARY_CAN 4
#define engine_type_e_MRE_SUBARU_EJ18 37
#define engine_type_e_MRE_VW_B6 62
#define engine_type_e_NISSAN_PRIMERA 5
#define engine_type_e_POLARIS 35
#define engine_type_e_POLARIS_RZR 9
#define engine_type_e_PROTEUS_ANALOG_PWM_TEST 30
#define engine_type_e_PROTEUS_BMW_M73 63
#define engine_type_e_PROTEUS_GM_LS_4 27
#define engine_type_e_PROTEUS_LUA_DEMO 25
#define engine_type_e_PROTEUS_NISSAN_VQ35 103
#define engine_type_e_PROTEUS_QC_TEST_BOARD 42
#define engine_type_e_PROTEUS_STIM_QC 73
#define engine_type_e_PROTEUS_VW_B6 39
#define engine_type_e_SACHS 29
#define engine_type_e_SIMULATOR_CONFIG 92
#define engine_type_e_SUBARU_EG33 70
#define engine_type_e_TCU_4R70W 17
#define engine_type_e_TEST_100 100
#define engine_type_e_TEST_101 101
#define engine_type_e_TEST_33816 18
#define engine_type_e_TEST_CRANK_ENGINE 28
#define engine_type_e_TEST_DC_WASTEGATE_DISCOVERY 48
#define engine_type_e_TEST_ENGINE 26
#define engine_type_e_TEST_ENGINE_VVT 45
#define engine_type_e_TEST_ISSUE_366_BOTH 52
#define engine_type_e_TEST_ISSUE_366_RISE 53
#define engine_type_e_TEST_ISSUE_6451 93
#define engine_type_e_TEST_ROTARY 19
#define engine_type_e_TOYOTA_1NZ_FE 13
#define engine_type_e_TOYOTA_2JZ_GTE_VVTi 44
#define engine_type_e_UNUSED102 102
#define engine_type_e_UNUSED47 47
#define engine_type_e_UNUSED49 49
#define engine_type_e_UNUSED67 67
#define engine_type_e_UNUSED94 94
#define engine_type_e_UNUSED_65 65
#define engine_type_e_UNUSED_97 97
#define engine_type_e_VW_ABA 32
#define engine_type_e_WASTEGATE_PROTEUS_TEST 96
#define engineSyncCam_enum "Intake First Bank", "Exhaust First Bank", "Intake Second Bank", "Exhaust Second Bank"
#define ETB2_TRIM_SIZE 6
#define ETB_BIAS_CURVE_LENGTH 8
#define ETB_COUNT 2
#define ETB_HW_MAX_FREQUENCY 3000
#define FLASH_DATA_VERSION 20016
#define FRONTEND_TITLE_BAR_NAME "rusEFI"
#define fuel_cyl_trim_s_size 16
#define FUEL_LEVEL_TABLE_COUNT 8
#define FUEL_LOAD_COUNT 16
#define fuel_pressure_sensor_mode_e_auto_enum 0="FPM_Absolute",2="FPM_Differential",1="FPM_Gauge"
#define fuel_pressure_sensor_mode_e_enum "Absolute", "Gauge", "Differential", "INVALID"
#define fuel_pressure_sensor_mode_e_FPM_Absolute 0
#define fuel_pressure_sensor_mode_e_FPM_Differential 2
#define fuel_pressure_sensor_mode_e_FPM_Gauge 1
#define FUEL_RPM_COUNT 16
#define FUEL_TRIM_SIZE 4
#define GAP_TRACKING_LENGTH 18
#define GAUGE_CATEGORY_BOOST_CONTROL "Boost Control"
#define GAUGE_CATEGORY_ETB "ETB more"
#define GAUGE_CATEGORY_FUEL_MATH "Fuel: math"
#define GAUGE_CATEGORY_SYNC "Sync"
#define GAUGE_CATEGORY_TIMING "Timing"
#define GAUGE_COIL_DWELL_TIME "Ignition: coil charge time"
#define GAUGE_LUA_FROM_0 -30000
#define GAUGE_LUA_FROM_1 -30000
#define GAUGE_LUA_FROM_2 -30000
#define GAUGE_LUA_FROM_3 -30000
#define GAUGE_LUA_FROM_4 -30000
#define GAUGE_LUA_FROM_5 -30000
#define GAUGE_LUA_FROM_6 -30000
#define GAUGE_LUA_FROM_7 -30000
#define GAUGE_LUA_TO_0 30000
#define GAUGE_LUA_TO_1 30000
#define GAUGE_LUA_TO_2 30000
#define GAUGE_LUA_TO_3 30000
#define GAUGE_LUA_TO_4 30000
#define GAUGE_LUA_TO_5 30000
#define GAUGE_LUA_TO_6 30000
#define GAUGE_LUA_TO_7 30000
#define GAUGE_NAME_AC_PRESSURE "A/C pressure"
#define GAUGE_NAME_ACCEL_LAT "Accel: Lateral"
#define GAUGE_NAME_ACCEL_LON "Accel: Longitudinal"
#define GAUGE_NAME_ACCEL_ROLL "Acceleration: Roll"
#define GAUGE_NAME_ACCEL_VERT "Accel: Vertical"
#define GAUGE_NAME_ACCEL_YAW "Acceleration: Yaw"
#define GAUGE_NAME_ADJUSTED_TIMING "Timing: ignition"
#define GAUGE_NAME_AFR "Air/Fuel Ratio"
#define GAUGE_NAME_AFR2 "Air/Fuel Ratio 2"
#define GAUGE_NAME_AFR2_GAS_SCALE "Air/Fuel Ratio 2 (Gas Scale)"
#define GAUGE_NAME_AFR_GAS_SCALE "Air/Fuel Ratio (Gas Scale)"
#define GAUGE_NAME_AIR_FLOW_ESTIMATE "Air: Flow estimate"
#define GAUGE_NAME_AIR_FLOW_MEASURED "MAF"
#define GAUGE_NAME_AIR_FLOW_MEASURED_2 "MAF #2"
#define GAUGE_NAME_AIR_MASS "Air: Cylinder airmass"
#define GAUGE_NAME_AUX_LINEAR_1 "Aux linear #1"
#define GAUGE_NAME_AUX_LINEAR_2 "Aux linear #2"
#define GAUGE_NAME_AUX_LINEAR_3 "Aux linear #3"
#define GAUGE_NAME_AUX_LINEAR_4 "Aux linear #4"
#define GAUGE_NAME_AUX_TEMP1 "Aux temp 1"
#define GAUGE_NAME_AUX_TEMP2 "Aux temp 2"
#define GAUGE_NAME_BARO_PRESSURE "Barometric pressure"
#define GAUGE_NAME_BOOST_CLOSED_LOOP "Boost: Closed loop"
#define GAUGE_NAME_BOOST_OPEN_LOOP "Boost: Open loop"
#define GAUGE_NAME_BOOST_OUTPUT "Boost: Output"
#define GAUGE_NAME_BOOST_TARGET "Boost: Target"
#define GAUGE_NAME_CAN_READ_OK "CAN: Rx"
#define GAUGE_NAME_CAN_WRITE_ERR "CAN: Tx err"
#define GAUGE_NAME_CAN_WRITE_OK "CAN: Tx OK"
#define GAUGE_NAME_CLT "CLT"
#define GAUGE_NAME_CPU_TEMP "CPU Temperature"
#define GAUGE_NAME_CURRENT_GEAR "Current Gear"
#define GAUGE_NAME_DEBUG_F1 "debug f1"
#define GAUGE_NAME_DEBUG_F2 "debug f2: iTerm"
#define GAUGE_NAME_DEBUG_F3 "debug f3: prevError"
#define GAUGE_NAME_DEBUG_F4 "debug f4: iParam"
#define GAUGE_NAME_DEBUG_F5 "debug f5: dParam"
#define GAUGE_NAME_DEBUG_F6 "debug f6: dTerm"
#define GAUGE_NAME_DEBUG_F7 "debug f7"
#define GAUGE_NAME_DEBUG_I1 "debug i1: pParam"
#define GAUGE_NAME_DEBUG_I2 "debug i2: offset"
#define GAUGE_NAME_DEBUG_I3 "debug i3"
#define GAUGE_NAME_DEBUG_I4 "debug i4"
#define GAUGE_NAME_DEBUG_I5 "debug i5"
#define GAUGE_NAME_DESIRED_GEAR "TCU: Desired Gear"
#define GAUGE_NAME_DETECTED_GEAR "Detected Gear"
#define GAUGE_NAME_DWELL_DUTY "Ignition: coil duty cycle"
#define GAUGE_NAME_ECU_TEMPERATURE "ECU temperature"
#define GAUGE_NAME_ENGINE_CRC16 "Engine CRC16"
#define GAUGE_NAME_ETB_DUTY "ETB: Duty"
#define GAUGE_NAME_ETB_ERROR "ETB: position error"
#define GAUGE_NAME_ETB_TARGET "ETB: position target"
#define GAUGE_NAME_FLEX "Flex Ethanol %"
#define GAUGE_NAME_FUEL_BARO_CORR "Fuel: Barometric pressure mult"
#define GAUGE_NAME_FUEL_BASE "Fuel: base cycle mass"
#define GAUGE_NAME_FUEL_CHARGE_TEMP "Fuel: Estimated charge temperature"
#define GAUGE_NAME_FUEL_CLT_CORR "Fuel: CLT correction"
#define GAUGE_NAME_FUEL_CONSUMPTION "Fuel: Total consumed"
#define GAUGE_NAME_FUEL_CRANKING "Fuel: cranking"
#define GAUGE_NAME_FUEL_FLOW "Fuel: Flow rate"
#define GAUGE_NAME_FUEL_IAT_CORR "Fuel: IAT correction"
#define GAUGE_NAME_FUEL_INJ_DUTY "Fuel: injector duty cycle"
#define GAUGE_NAME_FUEL_INJ_DUTY_STAGE_2 "Fuel: injector duty cycle stage 2"
#define GAUGE_NAME_FUEL_INJECTION_TIMING "Fuel: Injection timing SOI"
#define GAUGE_NAME_FUEL_LAST_INJECTION "Fuel: Last inj pulse width"
#define GAUGE_NAME_FUEL_LAST_INJECTION_STAGE_2 "Fuel: Last inj pulse width stg 2"
#define GAUGE_NAME_FUEL_LEVEL "Fuel level"
#define GAUGE_NAME_FUEL_LOAD "Fuel: Load"
#define GAUGE_NAME_FUEL_PRESSURE_HIGH "Fuel pressure (high)"
#define GAUGE_NAME_FUEL_PRESSURE_HIGH_UNITS "bar"
#define GAUGE_NAME_FUEL_PRESSURE_LOW "Fuel pressure (low)"
#define GAUGE_NAME_FUEL_PRESSURE_LOW_UNITS "kPa"
#define GAUGE_NAME_FUEL_RUNNING "Fuel: running"
#define GAUGE_NAME_FUEL_TEMPERATURE "Fuel Temperature"
#define GAUGE_NAME_FUEL_TPS_EXTRA "Fuel: TPS AE add fuel ms"
#define GAUGE_NAME_FUEL_TPS_ROC "Fuel: TPS change"
#define GAUGE_NAME_FUEL_TRIM "Fuel: fuel trim"
#define GAUGE_NAME_FUEL_TRIM_2 "Fuel: fuel trim 2"
#define GAUGE_NAME_FUEL_VE "Fuel: VE"
#define GAUGE_NAME_FUEL_WALL_AMOUNT "Fuel: wall amount"
#define GAUGE_NAME_FUEL_WALL_CORRECTION "Fuel: wall correction"
#define GAUGE_NAME_FW_VERSION "ECU Software Version"
#define GAUGE_NAME_GEAR_RATIO "Gearbox Ratio"
#define GAUGE_NAME_GYRO_YAW "Gyro: Yaw rate"
#define GAUGE_NAME_IAC "Idle: Position"
#define GAUGE_NAME_IAT "IAT"
#define GAUGE_NAME_IDLE_POSITION "Idle: Position sensor"
#define GAUGE_NAME_IGNITION_LOAD "Ignition: load"
#define GAUGE_NAME_IGNITION_MODE "Ignition: Mode"
#define GAUGE_NAME_INJECTION_MODE "Fuel: Injection mode"
#define GAUGE_NAME_INJECTOR_LAG "Fuel: injector lag"
#define GAUGE_NAME_ISS "TCU: Input Shaft Speed"
#define GAUGE_NAME_KNOCK_1 "knock 1"
#define GAUGE_NAME_KNOCK_10 "knock 10"
#define GAUGE_NAME_KNOCK_11 "knock 11"
#define GAUGE_NAME_KNOCK_12 "knock 12"
#define GAUGE_NAME_KNOCK_2 "knock 2"
#define GAUGE_NAME_KNOCK_3 "knock 3"
#define GAUGE_NAME_KNOCK_4 "knock 4"
#define GAUGE_NAME_KNOCK_5 "knock 5"
#define GAUGE_NAME_KNOCK_6 "knock 6"
#define GAUGE_NAME_KNOCK_7 "knock 7"
#define GAUGE_NAME_KNOCK_8 "knock 8"
#define GAUGE_NAME_KNOCK_9 "knock 9"
#define GAUGE_NAME_KNOCK_COUNTER "Knock: Count"
#define GAUGE_NAME_KNOCK_FREQ "knock: frequency"
#define GAUGE_NAME_KNOCK_LEVEL "Knock: Current level"
#define GAUGE_NAME_KNOCK_RETARD "Knock: Retard"
#define GAUGE_NAME_LAMBDA "Lambda"
#define GAUGE_NAME_LAMBDA2 "Lambda 2"
#define GAUGE_NAME_LAST_ERROR "Warning: last"
#define GAUGE_NAME_LUA_0 "Lua Gauge 1"
#define GAUGE_NAME_LUA_1 "Lua Gauge 2"
#define GAUGE_NAME_LUA_2 "Lua Gauge 3"
#define GAUGE_NAME_LUA_3 "Lua Gauge 4"
#define GAUGE_NAME_LUA_4 "Lua Gauge 5"
#define GAUGE_NAME_LUA_5 "Lua Gauge 6"
#define GAUGE_NAME_LUA_6 "Lua Gauge 7"
#define GAUGE_NAME_LUA_7 "Lua Gauge 8"
#define GAUGE_NAME_MAF "MAF"
#define GAUGE_NAME_MAP "MAP"
#define GAUGE_NAME_OIL_PRESSURE "Oil Pressure"
#define GAUGE_NAME_OIL_PRESSURE_UNITS "kPa"
#define GAUGE_NAME_RAW_FUEL_PRESSURE_HIGH "Fuel pressure raw (high)"
#define GAUGE_NAME_RAW_FUEL_PRESSURE_LOW "Fuel pressure raw (low)"
#define GAUGE_NAME_RPM "RPM"
#define GAUGE_NAME_TARGET_AFR "Fuel: target AFR"
#define GAUGE_NAME_TARGET_LAMBDA "Fuel: target lambda"
#define GAUGE_NAME_TC_RATIO "TCU: Torque Converter Ratio"
#define GAUGE_NAME_TCHARGE "Air: SD tCharge"
#define GAUGE_NAME_THROTTLE_PEDAL "Throttle pedal position"
#define GAUGE_NAME_TIME "Time"
#define GAUGE_NAME_TIMING_ADVANCE "Timing: base ignition"
#define GAUGE_NAME_TPS "TPS"
#define GAUGE_NAME_TPS2 "TPS2"
#define GAUGE_NAME_TRG_ERR "Trigger Error Counter"
#define GAUGE_NAME_TRG_GAP "Trigger Sync Latest Ratio"
#define GAUGE_NAME_TUNE_CRC16 "Tune CRC16"
#define GAUGE_NAME_TURBO_SPEED "Turbocharger Speed"
#define GAUGE_NAME_UPTIME "Uptime"
#define GAUGE_NAME_VBAT "VBatt"
#define GAUGE_NAME_VERSION "firmware"
#define GAUGE_NAME_VVS "Vehicle Speed"
#define GAUGE_NAME_VVT_B1E "VVT: bank 1 exhaust"
#define GAUGE_NAME_VVT_B1I "VVT: bank 1 intake"
#define GAUGE_NAME_VVT_B2E "VVT: bank 2 exhaust"
#define GAUGE_NAME_VVT_B2I "VVT: bank 2 intake"
#define GAUGE_NAME_VVT_TARGET_B1E "VVT: bank 1 exhaust target"
#define GAUGE_NAME_VVT_TARGET_B1I "VVT: bank 1 intake target"
#define GAUGE_NAME_VVT_TARGET_B2E "VVT: bank 2 exhaust target"
#define GAUGE_NAME_VVT_TARGET_B2I "VVT: bank 2 intake target"
#define GAUGE_NAME_WARNING_COUNT "Warning count"
#define GAUGE_NAME_WARNING_COUNTER "Warning: counter"
#define GAUGE_NAME_WARNING_LAST "Warning: last"
#define GAUGE_NAME_WG_POSITION "Wastegate position sensor"
#define gear_controller_e_enum "None", "Button Shift", "Automatic", "Generic"
#define gear_e_GEAR_1 1
#define gear_e_GEAR_2 2
#define gear_e_GEAR_3 3
#define gear_e_GEAR_4 4
#define gear_e_NEUTRAL 0
#define gear_e_REVERSE -1
#define GearControllerMode_auto_enum 0="None",2="Automatic",1="ButtonShift",3="Generic"
#define GearControllerMode_Automatic 2
#define GearControllerMode_ButtonShift 1
#define GearControllerMode_Generic 3
#define GearControllerMode_None 0
#define Gpio_A0 2
#define Gpio_A1 3
#define Gpio_A10 12
#define Gpio_A11 13
#define Gpio_A12 14
#define Gpio_A13 15
#define Gpio_A14 16
#define Gpio_A15 17
#define Gpio_A2 4
#define Gpio_A3 5
#define Gpio_A4 6
#define Gpio_A5 7
#define Gpio_A6 8
#define Gpio_A7 9
#define Gpio_A8 10
#define Gpio_A9 11
#define Gpio_auto_enum 0="Unassigned",2="A0",3="A1",12="A10",13="A11",14="A12",15="A13",16="A14",17="A15",4="A2",5="A3",6="A4",7="A5",8="A6",9="A7",10="A8",11="A9",18="B0",19="B1",28="B10",29="B11",30="B12",31="B13",32="B14",33="B15",20="B2",21="B3",22="B4",23="B5",24="B6",25="B7",26="B8",27="B9",34="C0",35="C1",44="C10",45="C11",46="C12",47="C13",48="C14",49="C15",36="C2",37="C3",38="C4",39="C5",40="C6",41="C7",42="C8",43="C9",249="CAN_PIN_0",250="CAN_PIN_1",251="CAN_PIN_2",252="CAN_PIN_3",253="CAN_PIN_4",254="CAN_PIN_5",255="CAN_PIN_6",256="CAN_PIN_7",50="D0",51="D1",60="D10",61="D11",62="D12",63="D13",64="D14",65="D15",52="D2",53="D3",54="D4",55="D5",56="D6",57="D7",58="D8",59="D9",66="E0",67="E1",76="E10",77="E11",78="E12",79="E13",80="E14",81="E15",68="E2",69="E3",70="E4",71="E5",72="E6",73="E7",74="E8",75="E9",82="F0",83="F1",92="F10",93="F11",94="F12",95="F13",96="F14",97="F15",84="F2",85="F3",86="F4",87="F5",88="F6",89="F7",90="F8",91="F9",98="G0",99="G1",108="G10",109="G11",110="G12",111="G13",112="G14",113="G15",100="G2",101="G3",102="G4",103="G5",104="G6",105="G7",106="G8",107="G9",114="H0",115="H1",124="H10",125="H11",126="H12",127="H13",128="H14",129="H15",116="H2",117="H3",118="H4",119="H5",120="H6",121="H7",122="H8",123="H9",130="I0",131="I1",140="I10",141="I11",142="I12",143="I13",144="I14",145="I15",132="I2",133="I3",134="I4",135="I5",136="I6",137="I7",138="I8",139="I9",1="Invalid",215="L9779_IGN_1",216="L9779_IGN_2",217="L9779_IGN_3",218="L9779_IGN_4",219="L9779_OUT_1",228="L9779_OUT_10",229="L9779_OUT_11",230="L9779_OUT_12",231="L9779_OUT_13",232="L9779_OUT_14",233="L9779_OUT_15",234="L9779_OUT_16",235="L9779_OUT_17",236="L9779_OUT_18",237="L9779_OUT_19",220="L9779_OUT_2",238="L9779_OUT_20",243="L9779_OUT_25",244="L9779_OUT_26",245="L9779_OUT_27",246="L9779_OUT_28",221="L9779_OUT_3",222="L9779_OUT_4",223="L9779_OUT_5",224="L9779_OUT_6",225="L9779_OUT_7",226="L9779_OUT_8",227="L9779_OUT_9",239="L9779_OUT_A",240="L9779_OUT_B",241="L9779_OUT_C",242="L9779_OUT_D",247="L9779_OUT_MRD",248="L9779_PIN_KEY",284="MC33810_0_GD_0",285="MC33810_0_GD_1",286="MC33810_0_GD_2",287="MC33810_0_GD_3",280="MC33810_0_OUT_0",281="MC33810_0_OUT_1",282="MC33810_0_OUT_2",283="MC33810_0_OUT_3",294="MC33810_1_GD_0",295="MC33810_1_GD_1",296="MC33810_1_GD_2",297="MC33810_1_GD_3",290="MC33810_1_OUT_0",291="MC33810_1_OUT_1",292="MC33810_1_OUT_2",293="MC33810_1_OUT_3",146="MC33972_PIN_1",155="MC33972_PIN_10",156="MC33972_PIN_11",157="MC33972_PIN_12",158="MC33972_PIN_13",159="MC33972_PIN_14",160="MC33972_PIN_15",161="MC33972_PIN_16",162="MC33972_PIN_17",163="MC33972_PIN_18",164="MC33972_PIN_19",147="MC33972_PIN_2",165="MC33972_PIN_20",166="MC33972_PIN_21",167="MC33972_PIN_22",148="MC33972_PIN_3",149="MC33972_PIN_4",150="MC33972_PIN_5",151="MC33972_PIN_6",152="MC33972_PIN_7",153="MC33972_PIN_8",154="MC33972_PIN_9",324="MSIOBOX_0_OUT_1",325="MSIOBOX_0_OUT_2",326="MSIOBOX_0_OUT_3",327="MSIOBOX_0_OUT_4",328="MSIOBOX_0_OUT_5",329="MSIOBOX_0_OUT_6",330="MSIOBOX_0_OUT_7",336="MSIOBOX_0_SW_1",337="MSIOBOX_0_SW_2",338="MSIOBOX_0_SW_3",332="MSIOBOX_0_VSS_1",333="MSIOBOX_0_VSS_2",334="MSIOBOX_0_VSS_3",335="MSIOBOX_0_VSS_4",257="PROTECTED_PIN_0",258="PROTECTED_PIN_1",267="PROTECTED_PIN_10",268="PROTECTED_PIN_11",269="PROTECTED_PIN_12",270="PROTECTED_PIN_13",271="PROTECTED_PIN_14",272="PROTECTED_PIN_15",259="PROTECTED_PIN_2",260="PROTECTED_PIN_3",261="PROTECTED_PIN_4",262="PROTECTED_PIN_5",263="PROTECTED_PIN_6",264="PROTECTED_PIN_7",265="PROTECTED_PIN_8",266="PROTECTED_PIN_9",199="TLE6240_PIN_1",208="TLE6240_PIN_10",209="TLE6240_PIN_11",210="TLE6240_PIN_12",211="TLE6240_PIN_13",212="TLE6240_PIN_14",213="TLE6240_PIN_15",214="TLE6240_PIN_16",200="TLE6240_PIN_2",201="TLE6240_PIN_3",202="TLE6240_PIN_4",203="TLE6240_PIN_5",204="TLE6240_PIN_6",205="TLE6240_PIN_7",206="TLE6240_PIN_8",207="TLE6240_PIN_9",168="TLE8888_PIN_1",177="TLE8888_PIN_10",178="TLE8888_PIN_11",179="TLE8888_PIN_12",180="TLE8888_PIN_13",181="TLE8888_PIN_14",182="TLE8888_PIN_15",183="TLE8888_PIN_16",184="TLE8888_PIN_17",185="TLE8888_PIN_18",186="TLE8888_PIN_19",169="TLE8888_PIN_2",187="TLE8888_PIN_20",188="TLE8888_PIN_21",189="TLE8888_PIN_22",190="TLE8888_PIN_23",191="TLE8888_PIN_24",192="TLE8888_PIN_25",193="TLE8888_PIN_26",194="TLE8888_PIN_27",195="TLE8888_PIN_28",170="TLE8888_PIN_3",171="TLE8888_PIN_4",172="TLE8888_PIN_5",173="TLE8888_PIN_6",174="TLE8888_PIN_7",175="TLE8888_PIN_8",176="TLE8888_PIN_9",197="TLE8888_PIN_KEY",196="TLE8888_PIN_MR",198="TLE8888_PIN_WAKE",300="TLE9104_0_OUT_0",301="TLE9104_0_OUT_1",302="TLE9104_0_OUT_2",303="TLE9104_0_OUT_3",304="TLE9104_1_OUT_0",305="TLE9104_1_OUT_1",306="TLE9104_1_OUT_2",307="TLE9104_1_OUT_3",308="TLE9104_2_OUT_0",309="TLE9104_2_OUT_1",310="TLE9104_2_OUT_2",311="TLE9104_2_OUT_3",312="TLE9104_3_OUT_0",313="TLE9104_3_OUT_1",314="TLE9104_3_OUT_2",315="TLE9104_3_OUT_3",316="TLE9104_4_OUT_0",317="TLE9104_4_OUT_1",318="TLE9104_4_OUT_2",319="TLE9104_4_OUT_3",320="TLE9104_5_OUT_0",321="TLE9104_5_OUT_1",322="TLE9104_5_OUT_2",323="TLE9104_5_OUT_3"
#define Gpio_B0 18
#define Gpio_B1 19
#define Gpio_B10 28
#define Gpio_B11 29
#define Gpio_B12 30
#define Gpio_B13 31
#define Gpio_B14 32
#define Gpio_B15 33
#define Gpio_B2 20
#define Gpio_B3 21
#define Gpio_B4 22
#define Gpio_B5 23
#define Gpio_B6 24
#define Gpio_B7 25
#define Gpio_B8 26
#define Gpio_B9 27
#define Gpio_C0 34
#define Gpio_C1 35
#define Gpio_C10 44
#define Gpio_C11 45
#define Gpio_C12 46
#define Gpio_C13 47
#define Gpio_C14 48
#define Gpio_C15 49
#define Gpio_C2 36
#define Gpio_C3 37
#define Gpio_C4 38
#define Gpio_C5 39
#define Gpio_C6 40
#define Gpio_C7 41
#define Gpio_C8 42
#define Gpio_C9 43
#define Gpio_CAN_PIN_0 249
#define Gpio_CAN_PIN_1 250
#define Gpio_CAN_PIN_2 251
#define Gpio_CAN_PIN_3 252
#define Gpio_CAN_PIN_4 253
#define Gpio_CAN_PIN_5 254
#define Gpio_CAN_PIN_6 255
#define Gpio_CAN_PIN_7 256
#define Gpio_D0 50
#define Gpio_D1 51
#define Gpio_D10 60
#define Gpio_D11 61
#define Gpio_D12 62
#define Gpio_D13 63
#define Gpio_D14 64
#define Gpio_D15 65
#define Gpio_D2 52
#define Gpio_D3 53
#define Gpio_D4 54
#define Gpio_D5 55
#define Gpio_D6 56
#define Gpio_D7 57
#define Gpio_D8 58
#define Gpio_D9 59
#define Gpio_E0 66
#define Gpio_E1 67
#define Gpio_E10 76
#define Gpio_E11 77
#define Gpio_E12 78
#define Gpio_E13 79
#define Gpio_E14 80
#define Gpio_E15 81
#define Gpio_E2 68
#define Gpio_E3 69
#define Gpio_E4 70
#define Gpio_E5 71
#define Gpio_E6 72
#define Gpio_E7 73
#define Gpio_E8 74
#define Gpio_E9 75
#define Gpio_enum "NONE", "INVALID", "PA0", "PA1", "PA2", "PA3", "PA4", "PA5", "PA6", "PA7", "PA8", "PA9", "PA10", "PA11", "PA12", "PA13", "PA14", "PA15", "PB0", "PB1", "PB2", "PB3", "PB4", "PB5", "PB6", "PB7", "PB8", "PB9", "PB10", "PB11", "PB12", "PB13", "PB14", "PB15", "PC0", "PC1", "PC2", "PC3", "PC4", "PC5", "PC6", "PC7", "PC8", "PC9", "PC10", "PC11", "PC12", "PC13", "PC14", "PC15", "PD0", "PD1", "PD2", "PD3", "PD4", "PD5", "PD6", "PD7", "PD8", "PD9", "PD10", "PD11", "PD12", "PD13", "PD14", "PD15", "PE0", "PE1", "PE2", "PE3", "PE4", "PE5", "PE6", "PE7", "PE8", "PE9", "PE10", "PE11", "PE12", "PE13", "PE14", "PE15", "PF0", "PF1", "PF2", "PF3", "PF4", "PF5", "PF6", "PF7", "PF8", "PF9", "PF10", "PF11", "PF12", "PF13", "PF14", "PF15", "PG0", "PG1", "PG2", "PG3", "PG4", "PG5", "PG6", "PG7", "PG8", "PG9", "PG10", "PG11", "PG12", "PG13", "PG14", "PG15", "PH0", "PH1", "PH2", "PH3", "PH4", "PH5", "PH6", "PH7", "PH8", "PH9", "PH10", "PH11", "PH12", "PH13", "PH14", "PH15", "PI0", "PI1", "PI2", "PI3", "PI4", "PI5", "PI6", "PI7", "PI8", "PI9", "PI10", "PI11", "PI12", "PI13", "PI14", "PI15"
#define Gpio_F0 82
#define Gpio_F1 83
#define Gpio_F10 92
#define Gpio_F11 93
#define Gpio_F12 94
#define Gpio_F13 95
#define Gpio_F14 96
#define Gpio_F15 97
#define Gpio_F2 84
#define Gpio_F3 85
#define Gpio_F4 86
#define Gpio_F5 87
#define Gpio_F6 88
#define Gpio_F7 89
#define Gpio_F8 90
#define Gpio_F9 91
#define Gpio_G0 98
#define Gpio_G1 99
#define Gpio_G10 108
#define Gpio_G11 109
#define Gpio_G12 110
#define Gpio_G13 111
#define Gpio_G14 112
#define Gpio_G15 113
#define Gpio_G2 100
#define Gpio_G3 101
#define Gpio_G4 102
#define Gpio_G5 103
#define Gpio_G6 104
#define Gpio_G7 105
#define Gpio_G8 106
#define Gpio_G9 107
#define Gpio_H0 114
#define Gpio_H1 115
#define Gpio_H10 124
#define Gpio_H11 125
#define Gpio_H12 126
#define Gpio_H13 127
#define Gpio_H14 128
#define Gpio_H15 129
#define Gpio_H2 116
#define Gpio_H3 117
#define Gpio_H4 118
#define Gpio_H5 119
#define Gpio_H6 120
#define Gpio_H7 121
#define Gpio_H8 122
#define Gpio_H9 123
#define Gpio_I0 130
#define Gpio_I1 131
#define Gpio_I10 140
#define Gpio_I11 141
#define Gpio_I12 142
#define Gpio_I13 143
#define Gpio_I14 144
#define Gpio_I15 145
#define Gpio_I2 132
#define Gpio_I3 133
#define Gpio_I4 134
#define Gpio_I5 135
#define Gpio_I6 136
#define Gpio_I7 137
#define Gpio_I8 138
#define Gpio_I9 139
#define Gpio_Invalid 1
#define Gpio_L9779_IGN_1 215
#define Gpio_L9779_IGN_2 216
#define Gpio_L9779_IGN_3 217
#define Gpio_L9779_IGN_4 218
#define Gpio_L9779_OUT_1 219
#define Gpio_L9779_OUT_10 228
#define Gpio_L9779_OUT_11 229
#define Gpio_L9779_OUT_12 230
#define Gpio_L9779_OUT_13 231
#define Gpio_L9779_OUT_14 232
#define Gpio_L9779_OUT_15 233
#define Gpio_L9779_OUT_16 234
#define Gpio_L9779_OUT_17 235
#define Gpio_L9779_OUT_18 236
#define Gpio_L9779_OUT_19 237
#define Gpio_L9779_OUT_2 220
#define Gpio_L9779_OUT_20 238
#define Gpio_L9779_OUT_25 243
#define Gpio_L9779_OUT_26 244
#define Gpio_L9779_OUT_27 245
#define Gpio_L9779_OUT_28 246
#define Gpio_L9779_OUT_3 221
#define Gpio_L9779_OUT_4 222
#define Gpio_L9779_OUT_5 223
#define Gpio_L9779_OUT_6 224
#define Gpio_L9779_OUT_7 225
#define Gpio_L9779_OUT_8 226
#define Gpio_L9779_OUT_9 227
#define Gpio_L9779_OUT_A 239
#define Gpio_L9779_OUT_B 240
#define Gpio_L9779_OUT_C 241
#define Gpio_L9779_OUT_D 242
#define Gpio_L9779_OUT_MRD 247
#define Gpio_L9779_PIN_KEY 248
#define Gpio_MC33810_0_GD_0 284
#define Gpio_MC33810_0_GD_1 285
#define Gpio_MC33810_0_GD_2 286
#define Gpio_MC33810_0_GD_3 287
#define Gpio_MC33810_0_OUT_0 280
#define Gpio_MC33810_0_OUT_1 281
#define Gpio_MC33810_0_OUT_2 282
#define Gpio_MC33810_0_OUT_3 283
#define Gpio_MC33810_1_GD_0 294
#define Gpio_MC33810_1_GD_1 295
#define Gpio_MC33810_1_GD_2 296
#define Gpio_MC33810_1_GD_3 297
#define Gpio_MC33810_1_OUT_0 290
#define Gpio_MC33810_1_OUT_1 291
#define Gpio_MC33810_1_OUT_2 292
#define Gpio_MC33810_1_OUT_3 293
#define Gpio_MC33972_PIN_1 146
#define Gpio_MC33972_PIN_10 155
#define Gpio_MC33972_PIN_11 156
#define Gpio_MC33972_PIN_12 157
#define Gpio_MC33972_PIN_13 158
#define Gpio_MC33972_PIN_14 159
#define Gpio_MC33972_PIN_15 160
#define Gpio_MC33972_PIN_16 161
#define Gpio_MC33972_PIN_17 162
#define Gpio_MC33972_PIN_18 163
#define Gpio_MC33972_PIN_19 164
#define Gpio_MC33972_PIN_2 147
#define Gpio_MC33972_PIN_20 165
#define Gpio_MC33972_PIN_21 166
#define Gpio_MC33972_PIN_22 167
#define Gpio_MC33972_PIN_3 148
#define Gpio_MC33972_PIN_4 149
#define Gpio_MC33972_PIN_5 150
#define Gpio_MC33972_PIN_6 151
#define Gpio_MC33972_PIN_7 152
#define Gpio_MC33972_PIN_8 153
#define Gpio_MC33972_PIN_9 154
#define Gpio_MSIOBOX_0_OUT_1 324
#define Gpio_MSIOBOX_0_OUT_2 325
#define Gpio_MSIOBOX_0_OUT_3 326
#define Gpio_MSIOBOX_0_OUT_4 327
#define Gpio_MSIOBOX_0_OUT_5 328
#define Gpio_MSIOBOX_0_OUT_6 329
#define Gpio_MSIOBOX_0_OUT_7 330
#define Gpio_MSIOBOX_0_SW_1 336
#define Gpio_MSIOBOX_0_SW_2 337
#define Gpio_MSIOBOX_0_SW_3 338
#define Gpio_MSIOBOX_0_VSS_1 332
#define Gpio_MSIOBOX_0_VSS_2 333
#define Gpio_MSIOBOX_0_VSS_3 334
#define Gpio_MSIOBOX_0_VSS_4 335
#define Gpio_PROTECTED_PIN_0 257
#define Gpio_PROTECTED_PIN_1 258
#define Gpio_PROTECTED_PIN_10 267
#define Gpio_PROTECTED_PIN_11 268
#define Gpio_PROTECTED_PIN_12 269
#define Gpio_PROTECTED_PIN_13 270
#define Gpio_PROTECTED_PIN_14 271
#define Gpio_PROTECTED_PIN_15 272
#define Gpio_PROTECTED_PIN_2 259
#define Gpio_PROTECTED_PIN_3 260
#define Gpio_PROTECTED_PIN_4 261
#define Gpio_PROTECTED_PIN_5 262
#define Gpio_PROTECTED_PIN_6 263
#define Gpio_PROTECTED_PIN_7 264
#define Gpio_PROTECTED_PIN_8 265
#define Gpio_PROTECTED_PIN_9 266
#define Gpio_TLE6240_PIN_1 199
#define Gpio_TLE6240_PIN_10 208
#define Gpio_TLE6240_PIN_11 209
