pawelr89/fw-custom-mega-stm32f407vet6/generated/controllers/generated/rusefi_generated_mega-stm32f407vet6.h
#define Gpio_TLE6240_PIN_12 210
#define Gpio_TLE6240_PIN_13 211
#define Gpio_TLE6240_PIN_14 212
#define Gpio_TLE6240_PIN_15 213
#define Gpio_TLE6240_PIN_16 214
#define Gpio_TLE6240_PIN_2 200
#define Gpio_TLE6240_PIN_3 201
#define Gpio_TLE6240_PIN_4 202
#define Gpio_TLE6240_PIN_5 203
#define Gpio_TLE6240_PIN_6 204
#define Gpio_TLE6240_PIN_7 205
#define Gpio_TLE6240_PIN_8 206
#define Gpio_TLE6240_PIN_9 207
#define Gpio_TLE8888_PIN_1 168
#define Gpio_TLE8888_PIN_10 177
#define Gpio_TLE8888_PIN_11 178
#define Gpio_TLE8888_PIN_12 179
#define Gpio_TLE8888_PIN_13 180
#define Gpio_TLE8888_PIN_14 181
#define Gpio_TLE8888_PIN_15 182
#define Gpio_TLE8888_PIN_16 183
#define Gpio_TLE8888_PIN_17 184
#define Gpio_TLE8888_PIN_18 185
#define Gpio_TLE8888_PIN_19 186
#define Gpio_TLE8888_PIN_2 169
#define Gpio_TLE8888_PIN_20 187
#define Gpio_TLE8888_PIN_21 188
#define Gpio_TLE8888_PIN_22 189
#define Gpio_TLE8888_PIN_23 190
#define Gpio_TLE8888_PIN_24 191
#define Gpio_TLE8888_PIN_25 192
#define Gpio_TLE8888_PIN_26 193
#define Gpio_TLE8888_PIN_27 194
#define Gpio_TLE8888_PIN_28 195
#define Gpio_TLE8888_PIN_3 170
#define Gpio_TLE8888_PIN_4 171
#define Gpio_TLE8888_PIN_5 172
#define Gpio_TLE8888_PIN_6 173
#define Gpio_TLE8888_PIN_7 174
#define Gpio_TLE8888_PIN_8 175
#define Gpio_TLE8888_PIN_9 176
#define Gpio_TLE8888_PIN_KEY 197
#define Gpio_TLE8888_PIN_MR 196
#define Gpio_TLE8888_PIN_WAKE 198
#define Gpio_TLE9104_0_OUT_0 300
#define Gpio_TLE9104_0_OUT_1 301
#define Gpio_TLE9104_0_OUT_2 302
#define Gpio_TLE9104_0_OUT_3 303
#define Gpio_TLE9104_1_OUT_0 304
#define Gpio_TLE9104_1_OUT_1 305
#define Gpio_TLE9104_1_OUT_2 306
#define Gpio_TLE9104_1_OUT_3 307
#define Gpio_TLE9104_2_OUT_0 308
#define Gpio_TLE9104_2_OUT_1 309
#define Gpio_TLE9104_2_OUT_2 310
#define Gpio_TLE9104_2_OUT_3 311
#define Gpio_TLE9104_3_OUT_0 312
#define Gpio_TLE9104_3_OUT_1 313
#define Gpio_TLE9104_3_OUT_2 314
#define Gpio_TLE9104_3_OUT_3 315
#define Gpio_TLE9104_4_OUT_0 316
#define Gpio_TLE9104_4_OUT_1 317
#define Gpio_TLE9104_4_OUT_2 318
#define Gpio_TLE9104_4_OUT_3 319
#define Gpio_TLE9104_5_OUT_0 320
#define Gpio_TLE9104_5_OUT_1 321
#define Gpio_TLE9104_5_OUT_2 322
#define Gpio_TLE9104_5_OUT_3 323
#define Gpio_Unassigned 0
#define GPPWM_1_NAME "General Purpose PWM 1"
#define GPPWM_2_NAME "General Purpose PWM 2"
#define GPPWM_3_NAME "General Purpose PWM 3"
#define GPPWM_4_NAME "General Purpose PWM 4"
#define gppwm_channel_e_auto_enum 0="GPPWM_Zero",9="GPPWM_AccelPedal",16="GPPWM_AuxLinear1",17="GPPWM_AuxLinear2",29="GPPWM_AuxLinear3",30="GPPWM_AuxLinear4",7="GPPWM_AuxTemp1",8="GPPWM_AuxTemp2",26="GPPWM_BaroPressure",3="GPPWM_Clt",25="GPPWM_DetectedGear",27="GPPWM_Egt1",28="GPPWM_Egt2",15="GPPWM_EthanolPercent",5="GPPWM_FuelLoad",18="GPPWM_GppwmOutput1",19="GPPWM_GppwmOutput2",20="GPPWM_GppwmOutput3",21="GPPWM_GppwmOutput4",4="GPPWM_Iat",6="GPPWM_IgnLoad",22="GPPWM_LuaGauge1",23="GPPWM_LuaGauge2",2="GPPWM_Map",24="GPPWM_Rpm",1="GPPWM_Tps",12="GPPWM_VVT_1E",11="GPPWM_VVT_1I",14="GPPWM_VVT_2E",13="GPPWM_VVT_2I",10="GPPWM_Vbatt",31="GPPWM_VehicleSpeed"
#define gppwm_channel_e_enum "Zero", "TPS", "MAP", "CLT", "IAT", "Fuel Load", "Ignition Load", "Aux Temp 1", "Aux Temp 2", "Accel Pedal", "Battery Voltage", "VVT 1 I", "VVT 1 E", "VVT 2 I", "VVT 2 E", "Ethanol (Flex) %", "Aux Linear 1", "Aux Linear 2", "GPPWM Output 1", "GPPWM Output 2", "GPPWM Output 3", "GPPWM Output 4", "Lua Gauge 1", "Lua Gauge 2", "RPM", "Gear (detected)", "Baro pressure", "EGT 1", "EGT 2", "Aux Linear 3", "Aux Linear 4", "Vehicle speed"
#define gppwm_channel_e_GPPWM_AccelPedal 9
#define gppwm_channel_e_GPPWM_AuxLinear1 16
#define gppwm_channel_e_GPPWM_AuxLinear2 17
#define gppwm_channel_e_GPPWM_AuxLinear3 29
#define gppwm_channel_e_GPPWM_AuxLinear4 30
#define gppwm_channel_e_GPPWM_AuxTemp1 7
#define gppwm_channel_e_GPPWM_AuxTemp2 8
#define gppwm_channel_e_GPPWM_BaroPressure 26
#define gppwm_channel_e_GPPWM_Clt 3
#define gppwm_channel_e_GPPWM_DetectedGear 25
#define gppwm_channel_e_GPPWM_Egt1 27
#define gppwm_channel_e_GPPWM_Egt2 28
#define gppwm_channel_e_GPPWM_EthanolPercent 15
#define gppwm_channel_e_GPPWM_FuelLoad 5
#define gppwm_channel_e_GPPWM_GppwmOutput1 18
#define gppwm_channel_e_GPPWM_GppwmOutput2 19
#define gppwm_channel_e_GPPWM_GppwmOutput3 20
#define gppwm_channel_e_GPPWM_GppwmOutput4 21
#define gppwm_channel_e_GPPWM_Iat 4
#define gppwm_channel_e_GPPWM_IgnLoad 6
#define gppwm_channel_e_GPPWM_LuaGauge1 22
#define gppwm_channel_e_GPPWM_LuaGauge2 23
#define gppwm_channel_e_GPPWM_Map 2
#define gppwm_channel_e_GPPWM_Rpm 24
#define gppwm_channel_e_GPPWM_Tps 1
#define gppwm_channel_e_GPPWM_Vbatt 10
#define gppwm_channel_e_GPPWM_VehicleSpeed 31
#define gppwm_channel_e_GPPWM_VVT_1E 12
#define gppwm_channel_e_GPPWM_VVT_1I 11
#define gppwm_channel_e_GPPWM_VVT_2E 14
#define gppwm_channel_e_GPPWM_VVT_2I 13
#define gppwm_channel_e_GPPWM_Zero 0
#define gppwm_channel_size 108
#define GPPWM_CHANNELS 4
#define gppwm_compare_mode_e_GPPWM_GreaterThan 0
#define gppwm_compare_mode_e_GPPWM_LessThan 1
#define GPPWM_LOAD_COUNT 8
#define GPPWM_NOTE_SIZE 16
#define GPPWM_RPM_COUNT 8
#define HIGH_SPEED_COUNT 32
#define hpfp_cam_e_auto_enum 0="HPFP_CAM_NONE",2="HPFP_CAM_EX1",4="HPFP_CAM_EX2",1="HPFP_CAM_IN1",3="HPFP_CAM_IN2"
#define hpfp_cam_e_enum "NONE", "Intake 1", "Exhaust 1", "Intake 2", "Exhaust 2"
#define hpfp_cam_e_HPFP_CAM_EX1 2
#define hpfp_cam_e_HPFP_CAM_EX2 4
#define hpfp_cam_e_HPFP_CAM_IN1 1
#define hpfp_cam_e_HPFP_CAM_IN2 3
#define hpfp_cam_e_HPFP_CAM_NONE 0
#define HPFP_COMPENSATION_SIZE 10
#define HPFP_DEADTIME_SIZE 8
#define HPFP_LOBE_PROFILE_SIZE 16
#define HPFP_TARGET_SIZE 10
#define IAC_PID_MULT_SIZE 8
#define IAT_CURVE_SIZE 16
#define IDLE_ADVANCE_CURVE_SIZE 8
#define idle_hardware_s_size 12
#define idle_mode_e_auto_enum 0="IM_AUTO",1="IM_MANUAL"
#define idle_mode_e_IM_AUTO 0
#define idle_mode_e_IM_MANUAL 1
#define idle_state_e_BLIP 64
#define idle_state_e_INIT 0
#define idle_state_e_PID_UPPER 16
#define idle_state_e_PID_VALUE 4
#define idle_state_e_RPM_DEAD_ZONE 2
#define idle_state_e_TPS_THRESHOLD 1
#define IDLE_VE_SIZE 4
#define IGN_BLEND_COUNT 4
#define ign_cyl_trim_s_size 16
#define IGN_LOAD_COUNT 16
#define IGN_RPM_COUNT 16
#define IGN_TRIM_SIZE 4
#define ignition_mode_e_auto_enum 0="IM_ONE_COIL",1="IM_INDIVIDUAL_COILS",3="IM_TWO_COILS",2="IM_WASTED_SPARK"
#define ignition_mode_e_IM_INDIVIDUAL_COILS 1
#define ignition_mode_e_IM_ONE_COIL 0
#define ignition_mode_e_IM_TWO_COILS 3
#define ignition_mode_e_IM_WASTED_SPARK 2
#define IGNITION_OUTPUT "Ignition Output"
#define imu_type_e_auto_enum 0="IMU_NONE",2="IMU_MM5_10",3="IMU_TYPE_3",4="IMU_TYPE_4",5="IMU_TYPE_MB_A0065422618",1="IMU_VAG"
#define imu_type_e_IMU_MM5_10 2
#define imu_type_e_IMU_NONE 0
#define imu_type_e_IMU_TYPE_3 3
#define imu_type_e_IMU_TYPE_4 4
#define imu_type_e_IMU_TYPE_MB_A0065422618 5
#define imu_type_e_IMU_VAG 1
#define INDICATOR_NAME_AC_SWITCH "AC switch"
#define INDICATOR_NAME_BRAKE_DOWN "Brake switch"
#define INDICATOR_NAME_CLUTCH_DOWN "Clutch: down"
#define INDICATOR_NAME_CLUTCH_UP "Clutch: up"
#define INJ_STAGING_COUNT 6
#define injection_mode_e_auto_enum 0="IM_SIMULTANEOUS",2="IM_BATCH",1="IM_SEQUENTIAL",3="IM_SINGLE_POINT"
#define injection_mode_e_IM_BATCH 2
#define injection_mode_e_IM_SEQUENTIAL 1
#define injection_mode_e_IM_SIMULTANEOUS 0
#define injection_mode_e_IM_SINGLE_POINT 3
#define InjectionTimingMode_auto_enum 0="End",2="Center",1="Start"
#define InjectionTimingMode_Center 2
#define InjectionTimingMode_End 0
#define InjectionTimingMode_Start 1
#define INJECTOR_1_NAME "Injector #1"
#define INJECTOR_2_NAME "Injector #2"
#define injector_compensation_mode_e_auto_enum 0="ICM_None",1="ICM_FixedRailPressure",2="ICM_SensedRailPressure"
#define injector_compensation_mode_e_ICM_FixedRailPressure 1
#define injector_compensation_mode_e_ICM_None 0
#define injector_compensation_mode_e_ICM_SensedRailPressure 2
#define injector_pressure_type_e_auto_enum 0="IPT_Low",1="IPT_High"
#define injector_pressure_type_e_IPT_High 1
#define injector_pressure_type_e_IPT_Low 0
#define injector_s_size 68
#define InjectorNonlinearMode_auto_enum 0="INJ_None",2="INJ_FordModel",1="INJ_PolynomialAdder"
#define InjectorNonlinearMode_INJ_FordModel 2
#define InjectorNonlinearMode_INJ_None 0
#define InjectorNonlinearMode_INJ_PolynomialAdder 1
#define KNOCK_TABLE_SIZE 6
#define launchActivationMode_e_ALWAYS_ACTIVE_LAUNCH 2
#define launchActivationMode_e_auto_enum 0="SWITCH_INPUT_LAUNCH",2="ALWAYS_ACTIVE_LAUNCH",1="CLUTCH_INPUT_LAUNCH",3="STOP_INPUT_LAUNCH"
#define launchActivationMode_e_CLUTCH_INPUT_LAUNCH 1
#define launchActivationMode_e_enum "Launch Button", "Clutch Down Switch", "Speed Based", "Brake Pedal"
#define launchActivationMode_e_STOP_INPUT_LAUNCH 3
#define launchActivationMode_e_SWITCH_INPUT_LAUNCH 0
#define linear_sensor_s_size 20
#define load_override_e_AFR_AccPedal 3
#define load_override_e_AFR_CylFilling 4
#define load_override_e_AFR_MAP 1
#define load_override_e_AFR_None 0
#define load_override_e_AFR_Tps 2
#define load_override_e_auto_enum 0="AFR_None",3="AFR_AccPedal",4="AFR_CylFilling",1="AFR_MAP",2="AFR_Tps"
#define load_override_e_enum "None", "MAP", "TPS", "Acc Pedal", "Cyl Filling %"
#define LOG_DELIMITER "`"
#define LOGIC_ANALYZER_CHANNEL_COUNT 4
#define LUA_ANALOG_INPUT_COUNT 8
#define LUA_DIGITAL_INPUT_COUNT 8
#define LUA_GAUGE_COUNT 8
#define LUA_PWM_COUNT 8
#define LUA_SCRIPT_SIZE 8000
#define MAF_DECODING_COUNT 32
#define maf_sensor_type_e_auto_enum 0="CUSTOM",2="Bosch0280218004",1="Bosch0280218037",3="DensoTODO"
#define maf_sensor_type_e_Bosch0280218004 2
#define maf_sensor_type_e_Bosch0280218037 1
#define maf_sensor_type_e_CUSTOM 0
#define maf_sensor_type_e_DensoTODO 3
#define maf_sensor_type_e_enum "v0", "v1", "v2", "v3"
#define MAIN_HELP_URL "http://www.rusefi.com/"
#define MAP_ANGLE_SIZE 8
#define MAP_sensor_config_s_size 140
#define MAP_UPPER_LIMIT 255
#define MAP_WINDOW_SIZE 8
#define MAX_CYLINDER_COUNT 12
#define MAX_TPS_PPS_DISCREPANCY 5
#define mc33810maxDwellTimer_e_auto_enum 0="DWELL_2MS",3="DWELL_16MS",4="DWELL_32MS",1="DWELL_4MS",5="DWELL_64MS",2="DWELL_8MS"
#define mc33810maxDwellTimer_e_DWELL_16MS 3
#define mc33810maxDwellTimer_e_DWELL_2MS 0
#define mc33810maxDwellTimer_e_DWELL_32MS 4
#define mc33810maxDwellTimer_e_DWELL_4MS 1
#define mc33810maxDwellTimer_e_DWELL_64MS 5
#define mc33810maxDwellTimer_e_DWELL_8MS 2
#define MENU_NAME_AUX_TEMP1 "AuxTemp1 sensor"
#define MENU_NAME_AUX_TEMP2 "AuxTemp2 sensor"
#define MLQ_FIELD_HEADER_SIZE 89
#define MLQ_HEADER_SIZE 24
#define MsIoBox_config_s_size 4
#define MsIoBoxId_auto_enum 0="OFF",1="ID200",2="ID220",3="ID240"
#define MsIoBoxId_enum "Off", "ID1 (0x200)", "ID2 (0x220)", "ID3 (0x240)"
#define MsIoBoxId_ID200 1
#define MsIoBoxId_ID220 2
#define MsIoBoxId_ID240 3
#define MsIoBoxId_OFF 0
#define MsIoBoxVss_ALL1234 3
#define MsIoBoxVss_auto_enum 0="OFF",3="ALL1234",2="HALL34",1="VR12"
#define MsIoBoxVss_enum "Off", "VR speed in (1, 2)", "Hall speed in (3, 4)", "All (1, 2, 3, 4)"
#define MsIoBoxVss_HALL34 2
#define MsIoBoxVss_OFF 0
#define MsIoBoxVss_VR12 1
#define operation_mode_e_FOUR_STROKE_CAM_SENSOR 2
#define operation_mode_e_FOUR_STROKE_CRANK_SENSOR 1
#define operation_mode_e_FOUR_STROKE_SIX_TIMES_CRANK_SENSOR 7
#define operation_mode_e_FOUR_STROKE_SYMMETRICAL_CRANK_SENSOR 4
#define operation_mode_e_FOUR_STROKE_THREE_TIMES_CRANK_SENSOR 5
#define operation_mode_e_FOUR_STROKE_TWELVE_TIMES_CRANK_SENSOR 6
#define operation_mode_e_OM_NONE 0
#define operation_mode_e_TWO_STROKE 3
#define output_pin_e_enum "NONE", "INVALID", "PA0", "PA1", "PA2", "PA3", "PA4", "PA5", "PA6", "PA7", "PA8", "PA9", "PA10", "PA11", "PA12", "PA13", "PA14", "PA15", "PB0", "PB1", "PB2", "PB3", "PB4", "PB5", "PB6", "PB7", "PB8", "PB9", "PB10", "PB11", "PB12", "PB13", "PB14", "PB15", "PC0", "PC1", "PC2", "PC3", "PC4", "PC5", "PC6", "PC7", "PC8", "PC9", "PC10", "PC11", "PC12", "PC13", "PC14", "PC15", "PD0", "PD1", "PD2", "PD3", "PD4", "PD5", "PD6", "PD7", "PD8", "PD9", "PD10", "PD11", "PD12", "PD13", "PD14", "PD15", "PE0", "PE1", "PE2", "PE3", "PE4", "PE5", "PE6", "PE7", "PE8", "PE9", "PE10", "PE11", "PE12", "PE13", "PE14", "PE15", "PF0", "PF1", "PF2", "PF3", "PF4", "PF5", "PF6", "PF7", "PF8", "PF9", "PF10", "PF11", "PF12", "PF13", "PF14", "PF15", "PG0", "PG1", "PG2", "PG3", "PG4", "PG5", "PG6", "PG7", "PG8", "PG9", "PG10", "PG11", "PG12", "PG13", "PG14", "PG15", "PH0", "PH1", "PH2", "PH3", "PH4", "PH5", "PH6", "PH7", "PH8", "PH9", "PH10", "PH11", "PH12", "PH13", "PH14", "PH15", "PI0", "PI1", "PI2", "PI3", "PI4", "PI5", "PI6", "PI7", "PI8", "PI9", "PI10", "PI11", "PI12", "PI13", "PI14", "PI15", "MC33972_1", "MC33972_2", "MC33972_3", "MC33972_4", "MC33972_5", "MC33972_6", "MC33972_7", "MC33972_8", "MC33972_9", "MC33972_10", "MC33972_11", "MC33972_12", "MC33972_13", "MC33972_14", "MC33972_15", "MC33972_16", "MC33972_17", "MC33972_18", "MC33972_19", "MC33972_20", "MC33972_21", "MC33972_22", "TLE8888_1", "TLE8888_2", "TLE8888_3", "TLE8888_4", "TLE8888_5", "TLE8888_6", "TLE8888_7", "TLE8888_8", "TLE8888_9", "TLE8888_10", "TLE8888_11", "TLE8888_12", "TLE8888_13", "TLE8888_14", "TLE8888_15", "TLE8888_16", "TLE8888_17", "TLE8888_18", "TLE8888_19", "TLE8888_20", "TLE8888_21", "TLE8888_22", "TLE8888_23", "TLE8888_24", "TLE8888_25", "TLE8888_26", "TLE8888_27", "TLE8888_28", "INVALID", "INVALID", "INVALID", "TLE6240_1", "TLE6240_2", "TLE6240_3", "TLE6240_4", "TLE6240_5", "TLE6240_6", "TLE6240_7", "TLE6240_8", "TLE6240_9", "TLE6240_10", "TLE6240_11", "TLE6240_12", "TLE6240_13", "TLE6240_14", "TLE6240_15", "TLE6240_16", "L215", "L216", "L217", "L218", "L219", "L220", "L221", "L222", "L223", "L224", "L225", "L226", "L227", "L228", "L229", "L230", "L231", "L232", "L233", "L234", "L235", "L236", "L237", "L238", "L239", "L240", "L241", "L242", "L243", "L244", "L245", "L246", "L247", "L248", "can0", "can1", "can2", "can3", "can4", "can5", "can6", "can7", "protected_0", "protected_1", "protected_2", "protected_3", "protected_4", "protected_5", "protected_6", "protected_7", "protected_8", "protected_9", "protected_10", "protected_11", "protected_12", "protected_13", "protected_14", "protected_15", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "MC33810_0_OUT_0", "MC33810_0_OUT_1", "MC33810_0_OUT_2", "MC33810_0_OUT_3", "MC33810_0_GD_0", "MC33810_0_GD_1", "MC33810_0_GD_2", "MC33810_0_GD_3"
#define output_pin_e_fullenum "NONE", "INVALID", "PA0", "PA1", "PA2", "PA3", "PA4", "PA5", "PA6", "PA7", "PA8", "PA9", "PA10", "PA11", "PA12", "PA13", "PA14", "PA15", "PB0", "PB1", "PB2", "PB3", "PB4", "PB5", "PB6", "PB7", "PB8", "PB9", "PB10", "PB11", "PB12", "PB13", "PB14", "PB15", "PC0", "PC1", "PC2", "PC3", "PC4", "PC5", "PC6", "PC7", "PC8", "PC9", "PC10", "PC11", "PC12", "PC13", "PC14", "PC15", "PD0", "PD1", "PD2", "PD3", "PD4", "PD5", "PD6", "PD7", "PD8", "PD9", "PD10", "PD11", "PD12", "PD13", "PD14", "PD15", "PE0", "PE1", "PE2", "PE3", "PE4", "PE5", "PE6", "PE7", "PE8", "PE9", "PE10", "PE11", "PE12", "PE13", "PE14", "PE15", "PF0", "PF1", "PF2", "PF3", "PF4", "PF5", "PF6", "PF7", "PF8", "PF9", "PF10", "PF11", "PF12", "PF13", "PF14", "PF15", "PG0", "PG1", "PG2", "PG3", "PG4", "PG5", "PG6", "PG7", "PG8", "PG9", "PG10", "PG11", "PG12", "PG13", "PG14", "PG15", "PH0", "PH1", "PH2", "PH3", "PH4", "PH5", "PH6", "PH7", "PH8", "PH9", "PH10", "PH11", "PH12", "PH13", "PH14", "PH15", "PI0", "PI1", "PI2", "PI3", "PI4", "PI5", "PI6", "PI7", "PI8", "PI9", "PI10", "PI11", "PI12", "PI13", "PI14", "PI15", "MC33972_1", "MC33972_2", "MC33972_3", "MC33972_4", "MC33972_5", "MC33972_6", "MC33972_7", "MC33972_8", "MC33972_9", "MC33972_10", "MC33972_11", "MC33972_12", "MC33972_13", "MC33972_14", "MC33972_15", "MC33972_16", "MC33972_17", "MC33972_18", "MC33972_19", "MC33972_20", "MC33972_21", "MC33972_22", "TLE8888_1", "TLE8888_2", "TLE8888_3", "TLE8888_4", "TLE8888_5", "TLE8888_6", "TLE8888_7", "TLE8888_8", "TLE8888_9", "TLE8888_10", "TLE8888_11", "TLE8888_12", "TLE8888_13", "TLE8888_14", "TLE8888_15", "TLE8888_16", "TLE8888_17", "TLE8888_18", "TLE8888_19", "TLE8888_20", "TLE8888_21", "TLE8888_22", "TLE8888_23", "TLE8888_24", "TLE8888_25", "TLE8888_26", "TLE8888_27", "TLE8888_28", "INVALID", "INVALID", "INVALID", "TLE6240_1", "TLE6240_2", "TLE6240_3", "TLE6240_4", "TLE6240_5", "TLE6240_6", "TLE6240_7", "TLE6240_8", "TLE6240_9", "TLE6240_10", "TLE6240_11", "TLE6240_12", "TLE6240_13", "TLE6240_14", "TLE6240_15", "TLE6240_16", "L215", "L216", "L217", "L218", "L219", "L220", "L221", "L222", "L223", "L224", "L225", "L226", "L227", "L228", "L229", "L230", "L231", "L232", "L233", "L234", "L235", "L236", "L237", "L238", "L239", "L240", "L241", "L242", "L243", "L244", "L245", "L246", "L247", "L248", "can0", "can1", "can2", "can3", "can4", "can5", "can6", "can7", "protected_0", "protected_1", "protected_2", "protected_3", "protected_4", "protected_5", "protected_6", "protected_7", "protected_8", "protected_9", "protected_10", "protected_11", "protected_12", "protected_13", "protected_14", "protected_15", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "MC33810_0_OUT_0", "MC33810_0_OUT_1", "MC33810_0_OUT_2", "MC33810_0_OUT_3", "MC33810_0_GD_0", "MC33810_0_GD_1", "MC33810_0_GD_2", "MC33810_0_GD_3"
#define PACK_ADD_TEMPERATURE 40
#define PACK_MULT_AFR 1000
#define PACK_MULT_AFR_CFG 10
#define PACK_MULT_ANGLE 50
#define PACK_MULT_EGTEMPERATURE 4
#define PACK_MULT_FLEX 2
#define PACK_MULT_FUEL_FLOW 200
#define PACK_MULT_FUEL_MASS 100
#define PACK_MULT_HIGH_PRESSURE 10
#define PACK_MULT_LAMBDA 10000
#define PACK_MULT_LAMBDA_CFG 147
#define PACK_MULT_MASS_FLOW 10
#define PACK_MULT_MS 300
#define PACK_MULT_PERCENT 100
#define PACK_MULT_PRESSURE 30
#define PACK_MULT_TEMPERATURE 100
#define PACK_MULT_VOLTAGE 1000
#define PACK_MULT_VSS 100
#define PACK_PERCENT_BYTE_MULT 100.0
#define PEDAL_TO_TPS_SIZE 8
#define pedalSensor_NAME "Accelerator pedal"
#define pedalToTpsTbl_NAME "ETB pedal target"
#define PERCENT_TRIM_BYTE_PACKING_DIV 0.02
#define persistent_config_s_size 22968
#define pid_s_size 20
#define pin_input_mode_e_auto_enum 0="PI_DEFAULT",2="PI_PULLDOWN",1="PI_PULLUP"
#define pin_input_mode_e_enum "DEFAULT", "PULLUP", "PULLDOWN"
#define pin_input_mode_e_PI_DEFAULT 0
#define pin_input_mode_e_PI_PULLDOWN 2
#define pin_input_mode_e_PI_PULLUP 1
#define pin_mode_e_enum "default", "INVALID", "INVALID", "INVALID", "opendrain", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "PULLUP", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "INVALID", "PULLDOWN"
#define pin_output_mode_e_auto_enum 0="OM_DEFAULT",1="OM_INVERTED",2="OM_OPENDRAIN",3="OM_OPENDRAIN_INVERTED"
#define pin_output_mode_e_enum "default", "default inverted", "open collector", "open collector inverted"
#define pin_output_mode_e_OM_DEFAULT 0
#define pin_output_mode_e_OM_INVERTED 1
#define pin_output_mode_e_OM_OPENDRAIN 2
#define pin_output_mode_e_OM_OPENDRAIN_INVERTED 3
#define PRIME_CURVE_COUNT 8
#define PROTOCOL_ANALOG_CHART "analog_chart"
#define PROTOCOL_COIL_SHORT_PREFIX "c"
#define PROTOCOL_CRANK1 "t1"
#define PROTOCOL_CRANK2 "t2"
#define PROTOCOL_ENGINE_SNIFFER "wave_chart"
#define PROTOCOL_ES_DOWN "d"
#define PROTOCOL_ES_UP "u"
#define PROTOCOL_HELLO_PREFIX "***"
#define PROTOCOL_INJ_SHORT_PREFIX "i"
#define PROTOCOL_INJ_STAGE2_SHORT_PREFIX "j"
#define PROTOCOL_KNOCK_SPECTROGRAMM "knock_spectrogram"
#define PROTOCOL_MSG "msg"
#define PROTOCOL_OUTPIN "outpin"
#define PROTOCOL_SIGNATURE_PREFIX "rusEFI "
#define PROTOCOL_TEST_RESPONSE_TAG "ts_p_alive"
#define PROTOCOL_VERSION_TAG "rusEfiVersion"
#define RANGE_INPUT_COUNT 6
#define REBOOT_COMMAND 0xbb
#define SCRIPT_CURVE_16 16
#define SCRIPT_CURVE_8 8
#define SCRIPT_CURVE_COUNT 6
#define SCRIPT_SETTING_COUNT 8
#define SCRIPT_TABLE_8 8
#define SCRIPT_TABLE_COUNT 4
#define SelectedGear_Drive 6
#define SelectedGear_Invalid 0
#define SelectedGear_Low 11
#define SelectedGear_Manual 7
#define SelectedGear_Manual1 10
#define SelectedGear_Manual2 9
#define SelectedGear_Manual3 8
#define SelectedGear_ManualMinus 2
#define SelectedGear_ManualPlus 1
#define SelectedGear_Neutral 5
#define SelectedGear_Park 3
#define SelectedGear_Reverse 4
#define sensor_chart_e_auto_enum 0="SC_OFF",5="SC_AUX_FAST1",4="SC_DETAILED_RPM",3="SC_RPM_ACCEL",1="SC_TRIGGER"
#define sensor_chart_e_enum "none", "trigger", "INVALID", "RPM ACCEL", "DETAILED RPM", "Fast Aux1"
#define sensor_chart_e_SC_AUX_FAST1 5
#define sensor_chart_e_SC_DETAILED_RPM 4
#define sensor_chart_e_SC_OFF 0
#define sensor_chart_e_SC_RPM_ACCEL 3
#define sensor_chart_e_SC_TRIGGER 1
#define SENT_INPUT_COUNT 1
#define sent_input_pin_e_enum "NONE", "INVALID", "PA0", "PA1", "PA2", "PA3", "PA4", "PA5", "PA6", "PA7", "PA8", "PA9", "PA10", "PA11", "PA12", "PA13", "PA14", "PA15", "PB0", "PB1", "PB2", "PB3", "PB4", "PB5", "PB6", "PB7", "PB8", "PB9", "PB10", "PB11", "PB12", "PB13", "PB14", "PB15", "PC0", "PC1", "PC2", "PC3", "PC4", "PC5", "PC6", "PC7", "PC8", "PC9", "PC10", "PC11", "PC12", "PC13", "PC14", "PC15", "PD0", "PD1", "PD2", "PD3", "PD4", "PD5", "PD6", "PD7", "PD8", "PD9", "PD10", "PD11", "PD12", "PD13", "PD14", "PD15", "PE0", "PE1", "PE2", "PE3", "PE4", "PE5", "PE6", "PE7", "PE8", "PE9", "PE10", "PE11", "PE12", "PE13", "PE14", "PE15", "PF0", "PF1", "PF2", "PF3", "PF4", "PF5", "PF6", "PF7", "PF8", "PF9", "PF10", "PF11", "PF12", "PF13", "PF14", "PF15", "PG0", "PG1", "PG2", "PG3", "PG4", "PG5", "PG6", "PG7", "PG8", "PG9", "PG10", "PG11", "PG12", "PG13", "PG14", "PG15", "PH0", "PH1", "PH2", "PH3", "PH4", "PH5", "PH6", "PH7", "PH8", "PH9", "PH10", "PH11", "PH12", "PH13", "PH14", "PH15", "PI0", "PI1", "PI2", "PI3", "PI4", "PI5", "PI6", "PI7", "PI8", "PI9", "PI10", "PI11", "PI12", "PI13", "PI14", "PI15"
#define SentEtbType_auto_enum 0="NONE",3="CUSTOM",2="FORD_TYPE_1",1="GM_TYPE_1"
#define SentEtbType_CUSTOM 3
#define SentEtbType_enum "None", "GM type 1", "Ford type 1", "Custom"
#define SentEtbType_FORD_TYPE_1 2
#define SentEtbType_GM_TYPE_1 1
#define SentEtbType_NONE 0
#define show_Frankenso_presets false
#define show_microRusEFI_presets false
#define show_Proteus_presets false
#define show_test_presets false
#define show_vvt_output_pin true
#define SIGNATURE_HASH 2137807551
#define SIMULATOR_TUNE_BIN_FILE_NAME "generated/simulator_tune_image.bin"
#define SIMULATOR_TUNE_BIN_FILE_NAME_PREFIX "generated/simulator_tune_image"
#define SIMULATOR_TUNE_BIN_FILE_NAME_SUFFIX ".bin"
#define smLaunchControl_NAME "Launch Control"
#define spi_device_e_auto_enum 0="SPI_NONE",1="SPI_DEVICE_1",2="SPI_DEVICE_2",3="SPI_DEVICE_3",4="SPI_DEVICE_4",5="SPI_DEVICE_5",6="SPI_DEVICE_6"
#define spi_device_e_SPI_DEVICE_1 1
#define spi_device_e_SPI_DEVICE_2 2
#define spi_device_e_SPI_DEVICE_3 3
#define spi_device_e_SPI_DEVICE_4 4
#define spi_device_e_SPI_DEVICE_5 5
#define spi_device_e_SPI_DEVICE_6 6
#define spi_device_e_SPI_NONE 0
#define spi_speed_e__150KHz 3
#define spi_speed_e__1_25MHz 2
#define spi_speed_e__2_5MHz 1
#define spi_speed_e__5MHz 0
#define stepper_num_micro_steps_e_auto_enum 0="STEPPER_FULL",8="STEPPER_EIGHTH",4="STEPPER_FOURTH",2="STEPPER_HALF"
#define stepper_num_micro_steps_e_enum "Full-Step (Default)", "INVALID", "Half-Step", "INVALID", "1/4 Micro-Step", "INVALID", "INVALID", "INVALID", "1/8 Micro-Step"
#define stepper_num_micro_steps_e_STEPPER_EIGHTH 8
#define stepper_num_micro_steps_e_STEPPER_FOURTH 4
#define stepper_num_micro_steps_e_STEPPER_FULL 0
#define stepper_num_micro_steps_e_STEPPER_HALF 2
#define STFT_BANK_COUNT 2
#define stft_cell_cfg_s_size 4
#define STFT_CELL_COUNT 4
#define stft_s_size 24
