pawelr89/fw-custom-mega-stm32f407vet6/generated/controllers/generated/rusefi_generated_mega-stm32f407vet6.h
#define uart_device_e_UART_DEVICE_1 1
#define uart_device_e_UART_DEVICE_2 2
#define uart_device_e_UART_DEVICE_3 3
#define uart_device_e_UART_DEVICE_4 4
#define uart_device_e_UART_NONE 0
#define UiMode_auto_enum 0="FULL",1="INSTALLATION",2="TUNING"
#define UiMode_enum "Full", "INVALID", "Tuning"
#define UiMode_FULL 0
#define UiMode_INSTALLATION 1
#define UiMode_TUNING 2
#define VBAT_INJECTOR_CURVE_SIZE 8
#define VE_BLEND_COUNT 4
#define VE_MENU_MAP_NAME "VE 3D view"
#define VE_MENU_NAME "VE"
#define ve_override_e_auto_enum 0="VE_None",1="VE_MAP",2="VE_TPS"
#define ve_override_e_enum "None", "MAP", "TPS"
#define ve_override_e_VE_MAP 1
#define ve_override_e_VE_None 0
#define ve_override_e_VE_TPS 2
#define VEHICLE_INFO_SIZE 32
#define VIN_NUMBER_SIZE 17
#define VOLTAGE_1_BYTE_PACKING_DIV 0.02
#define VR_THRESHOLD_COUNT 2
#define vr_threshold_s_size 16
#define VSS_FILTER_MAX 200
#define VSS_FILTER_MIN 3
#define VVT1_TARGET_NAME "VVT intake target"
#define vvt_mode_e_auto_enum 0="VVT_INACTIVE",8="VVT_BARRA_3_PLUS_1",5="VVT_BOSCH_QUICK_START",23="VVT_DEV",19="VVT_FORD_COYOTE",7="VVT_FORD_ST170",21="VVT_HONDA_CBR_600",16="VVT_HONDA_K_EXHAUST",10="VVT_HONDA_K_INTAKE",24="VVT_HR12DDR_IN",13="VVT_MAP_V_TWIN",22="VVT_MAZDA_L",15="VVT_MAZDA_SKYACTIV",3="VVT_MIATA_NB",12="VVT_MITSUBISHI_3A92",18="VVT_MITSUBISHI_4G63",4="VVT_MITSUBISHI_4G69",17="VVT_MITSUBISHI_4G9x",20="VVT_MITSUBISHI_6G72",14="VVT_MITSUBISHI_6G75",11="VVT_NISSAN_MR",9="VVT_NISSAN_VQ",1="VVT_SINGLE_TOOTH",2="VVT_TOYOTA_3_TOOTH",6="VVT_TOYOTA_4_1"
#define vvt_mode_e_enum "Inactive", "Single Tooth", "Toyota 3 Tooth", "Miata NB2", "Mitsu 4G69", "Bosch Quick Start", "4/1", "ST 170", "Ford Barra 3+1", "Nissan VQ", "Honda K Intake", "Nissan MR18", "Mitsu 3A92", "Sync by MAP", "Mitsu 6G75", "Mazda Skyactiv", "Honda K Exhaust", "Mitsubishi 4G92/93/94", "Mitsubishi 4G63", "Ford Coyote", "Mitsu 6G72", "Honda 600", "Mazda L", "Dev", "HR12DDR In", "vvt25", "vvt26"
#define vvt_mode_e_VVT_BARRA_3_PLUS_1 8
#define vvt_mode_e_VVT_BOSCH_QUICK_START 5
#define vvt_mode_e_VVT_DEV 23
#define vvt_mode_e_VVT_FORD_COYOTE 19
#define vvt_mode_e_VVT_FORD_ST170 7
#define vvt_mode_e_VVT_HONDA_CBR_600 21
#define vvt_mode_e_VVT_HONDA_K_EXHAUST 16
#define vvt_mode_e_VVT_HONDA_K_INTAKE 10
#define vvt_mode_e_VVT_HR12DDR_IN 24
#define vvt_mode_e_VVT_INACTIVE 0
#define vvt_mode_e_VVT_MAP_V_TWIN 13
#define vvt_mode_e_VVT_MAZDA_L 22
#define vvt_mode_e_VVT_MAZDA_SKYACTIV 15
#define vvt_mode_e_VVT_MIATA_NB 3
#define vvt_mode_e_VVT_MITSUBISHI_3A92 12
#define vvt_mode_e_VVT_MITSUBISHI_4G63 18
#define vvt_mode_e_VVT_MITSUBISHI_4G69 4
#define vvt_mode_e_VVT_MITSUBISHI_4G9x 17
#define vvt_mode_e_VVT_MITSUBISHI_6G72 20
#define vvt_mode_e_VVT_MITSUBISHI_6G75 14
#define vvt_mode_e_VVT_NISSAN_MR 11
#define vvt_mode_e_VVT_NISSAN_VQ 9
#define vvt_mode_e_VVT_SINGLE_TOOTH 1
#define vvt_mode_e_VVT_TOYOTA_3_TOOTH 2
#define vvt_mode_e_VVT_TOYOTA_4_1 6
#define VVT_TABLE_SIZE 8
#define VVT_TRACKING_LENGTH 4
#define WARNING_BUFFER_SIZE 120
#define WWAE_TABLE_SIZE 8
